{
  "batch_number": 2,
  "date": "2026-02-22",
  "prospects": [
    {
      "name": "Aditi Agrawal",
      "first_name": "Aditi",
      "title": "Director, Quality Engineering & Automation",
      "company": "Myridius",
      "location": "Albany, New York Metropolitan Area",
      "vertical": "Tech",
      "employee_count": 6000,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 5,
      "icp_score": 9,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [
        "buyer_intent"
      ],
      "company_desc": "Digital transformation consulting firm across financial services, insurance, and healthcare. Recently acquired by Aethereus (Sept 2024).",
      "person_detail": "17+ years dedicated to Quality Engineering. QE isn't just her job, it's her career mission.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "Post-acquisition QE",
      "touch_1_body": "Aditi, with Aethereus acquiring Myridius last year, how's the QE strategy holding up through the integration?\n\nThat's the moment where test suites built for one platform suddenly need to cover two, and maintenance tends to spiral.\n\nHansard cut regression from 8 weeks to 5 weeks using AI auto-heal with Testsigma during a similar integration period.\n\nWould 15 minutes to compare approaches be useful while you're navigating the transition?",
      "touch_2_call": "OPENER: Hey Aditi, this is Rob from Testsigma, quick one about the QE side of the Aethereus-Myridius integration.\nPAIN: Post-acquisition is usually when test maintenance doubles because you're suddenly covering two codebases.\nBRIDGE: Medibuddy automated 2,500 tests and cut maintenance 50% in a similar situation. Worth 60 seconds?",
      "touch_3_body": "Circling back, Aditi.\n\nDifferent angle: Sanofi compressed regression from 3 days to 80 minutes with Testsigma, specifically during a period of rapid platform change.\n\nGiven the Aethereus integration, worth a quick look?",
      "touch_4_call": "OPENER: Hey Aditi, Rob from Testsigma, following up on the QE conversation around your integration work.\nPAIN: One thing I hear from QE leaders post-acquisition is the locator breakage rate spikes 3-4x.\nBRIDGE: CRED hit 90% regression automation and 5x faster execution. Worth a quick chat about how?",
      "touch_5_subject": "QE during integration",
      "touch_5_body": "Aditi, last thought on this.\n\nA Fortune 100 company saw 3X productivity increase when they consolidated their test automation after an acquisition, and your situation at Myridius sounds similar.\n\nIf keeping regression cycles manageable through the Aethereus integration is on your radar, happy to walk through what worked for them.\n\nWould 15 minutes this week make sense?",
      "touch_6_body": "Aditi, I've reached out a few times and want to respect your time.\n\nIf the integration has you too deep in the weeds right now, totally get it. Just closing the loop so I'm not adding noise.\n\nDoor's always open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "sanofi_speed",
        "call_2": "cred_coverage",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Adrian O.",
      "first_name": "Adrian",
      "title": "Head of Central Quality",
      "company": "Light & Wonder",
      "location": "Henderson, Nevada",
      "vertical": "Tech",
      "employee_count": 7000,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 5,
      "icp_score": 9,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [
        "buyer_intent"
      ],
      "company_desc": "Gaming tech company providing slot machines, casino management systems, and cross-platform gaming solutions.",
      "person_detail": "Strategy, business process optimization, and global delivery. Recently moved into Head of Central Quality role.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "Central quality at L&W",
      "touch_1_body": "Adrian, standing up a centralized quality function across Light & Wonder's gaming portfolio is no small lift.\n\nIs the test coverage keeping pace across slots, casino management, and the cross-platform gaming stack?\n\nCRED hit 90% regression automation and 5x faster execution with Testsigma when they centralized their QA.\n\nWould 15 minutes to compare notes on the centralization approach be useful?",
      "touch_2_call": "OPENER: Hey Adrian, this is Rob from Testsigma, wanted to ask about the central quality function you're building at Light & Wonder.\nPAIN: Centralizing QA across multiple product lines usually means test suites that don't talk to each other and duplicated effort.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks after consolidating. Worth 60 seconds to see if it's relevant?",
      "touch_3_body": "Circling back, Adrian.\n\nDifferent angle: Medibuddy automated 2,500 tests and cut maintenance 50% with Testsigma across multiple product lines, which sounds similar to the cross-platform challenge at L&W.\n\nWorth a conversation?",
      "touch_4_call": "OPENER: Hey Adrian, Rob from Testsigma, following up on the QA centralization at Light & Wonder.\nPAIN: Gaming platforms with frequent content updates usually have the highest locator breakage rates I see.\nBRIDGE: Sanofi went from 3-day regression to 80 minutes. Quick chat to compare?",
      "touch_5_subject": "Cross-platform QA at L&W",
      "touch_5_body": "Adrian, one more thought.\n\nA Fortune 100 company saw 3X productivity increase after unifying their test automation under one platform, and their multi-product setup was similar to Light & Wonder's.\n\nIf scaling coverage across the gaming portfolio without scaling headcount is something you're working through, happy to share what worked for them.\n\nWould 15 minutes this week or next work?",
      "touch_6_body": "Adrian, just closing the loop here.\n\nIf the timing isn't right with the new role, totally understand. Happy to reconnect down the road.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Bear Sloan",
      "first_name": "Bear",
      "title": "Sr. Director, Quality Engineering",
      "company": "8am",
      "location": "Pflugerville, Texas",
      "vertical": "Tech",
      "employee_count": 200,
      "persona_type": "QA",
      "seniority": "Sr. Director",
      "priority_score": 4,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [
        "recently_promoted"
      ],
      "company_desc": "Enterprise software company focused on professional technology outcomes.",
      "person_detail": "Built QE team from ground up at cybersecurity startup Dragos. Recently promoted to Sr. Director.",
      "predicted_objection": "Too early, still assessing",
      "objection_response": "Makes sense. A lot of QA leaders in their first 90 days use our free trial to benchmark what's possible before committing.",
      "touch_1_subject": "Building QE at 8am",
      "touch_1_body": "Bear, you built QE from the ground up at Dragos, which tells me you know what it takes to stand up automation at a company that didn't have it before.\n\nIs the QE infrastructure at 8am at the point where maintenance is starting to eat into new test creation?\n\nA Fortune 100 company saw 3X productivity increase with Testsigma specifically because it let them scale without the usual Selenium maintenance drag.\n\nWould 15 minutes to compare frameworks be useful?",
      "touch_2_call": "OPENER: Hey Bear, this is Rob from Testsigma, congrats on the Sr. Director promotion at 8am.\nPAIN: Building QE from scratch means you're probably choosing your automation stack right now, and the wrong pick costs 6 months.\nBRIDGE: Medibuddy automated 2,500 tests and cut maintenance 50%. Worth 60 seconds to see if it fits?",
      "touch_3_body": "Circling back, Bear.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. The plain English approach meant their team ramped in weeks, not months.\n\nGiven you're building the QE function at 8am, worth a quick look?",
      "touch_4_call": "OPENER: Hey Bear, Rob from Testsigma, following up on the QE buildout at 8am.\nPAIN: When you built QE at Dragos, how much time went into framework maintenance vs. actual test coverage?\nBRIDGE: CRED hit 90% regression automation, 5x faster. Quick chat to compare approaches?",
      "touch_5_subject": "QE buildout at 8am",
      "touch_5_body": "Bear, one last angle on this.\n\nHansard cut regression from 8 weeks to 5 weeks with AI auto-heal, and their QE team was a similar size to what you're likely building at 8am.\n\nIf you're evaluating automation platforms as part of the buildout, could be useful to see how Testsigma compares to what you used at Dragos.\n\nWould 15 minutes make sense?",
      "touch_6_body": "Bear, want to respect your time.\n\nIf you're heads down building the QE function right now, totally get it. Happy to reconnect when the timing's better.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "fortune100_productivity",
        "call_1": "hansard_regression",
        "touch_3": "medibuddy_scale",
        "call_2": "cred_coverage",
        "touch_5": "sanofi_speed"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Shashin Surkund",
      "first_name": "Shashin",
      "title": "Vice President, Big Data Platforms",
      "company": "Fidelity Investments",
      "location": "Cary, North Carolina",
      "vertical": "FinServ",
      "employee_count": 78000,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 4,
      "icp_score": 8,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [
        "buyer_intent"
      ],
      "company_desc": "Financial services giant with trading platforms, brokerage software, portfolio management, 401k admin, and mobile investing apps.",
      "person_detail": "Leading a squad responsible for building future-ready big data platforms. 9+ years at Fidelity.",
      "predicted_objection": "Security/procurement is complex",
      "objection_response": "We offer on-prem, private cloud, and hybrid. SOC2/ISO certified. A few Fortune 500s run us behind their firewall.",
      "touch_1_subject": "Data platform testing",
      "touch_1_body": "Shashin, building future-ready big data platforms at Fidelity's scale means the testing surface area must be massive.\n\nIs validating data pipelines and platform changes keeping pace with how fast your team is shipping?\n\nCRED hit 90% regression automation and 5x faster execution with Testsigma across their platform stack.\n\nWould 15 minutes to see how that maps to Fidelity's data platform testing be worth it?",
      "touch_2_call": "OPENER: Hey Shashin, this is Rob from Testsigma, quick question about testing on the big data platform side at Fidelity.\nPAIN: Data platform teams usually have the hardest time keeping regression suites stable because the schemas change constantly.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks with AI auto-heal. Worth 60 seconds?",
      "touch_3_body": "Circling back, Shashin.\n\nDifferent angle: Sanofi went from 3-day regression to 80 minutes with Testsigma. Their platform complexity was comparable to what Fidelity runs.\n\nWorth a conversation?",
      "touch_4_call": "OPENER: Hey Shashin, Rob from Testsigma, following up on the data platform testing at Fidelity.\nPAIN: Medibuddy automated 2,500 tests and cut maintenance 50%, and their data validation workflows were a big chunk of that.\nBRIDGE: Quick chat to see if that's relevant to your setup?",
      "touch_5_subject": "Platform testing at Fidelity",
      "touch_5_body": "Shashin, last thought.\n\nA Fortune 100 company saw 3X productivity increase testing their platform infrastructure with Testsigma. The self-healing meant their tests survived schema and UI changes without manual fixes.\n\nIf keeping regression stable across Fidelity's data platforms is something your team deals with, happy to walk through the details.\n\nWould 15 minutes this week work?",
      "touch_6_body": "Shashin, closing the loop here.\n\nIf the timing isn't right, no problem at all. Happy to reconnect whenever it makes sense.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Alessandro Petroni",
      "first_name": "Alessandro",
      "title": "Head of Quality Engineering - Fraud Payment Services",
      "company": "The Clearing House",
      "location": "New York City Metropolitan Area",
      "vertical": "FinServ",
      "employee_count": 400,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 3,
      "icp_score": 8,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Payments infrastructure operator processing $2T+ daily in ACH, wire transfers, and real-time payments. Owned by major US banks.",
      "person_detail": "Two decades of expertise in financial services. Leads QE for fraud payment services division.",
      "predicted_objection": "Compliance requirements",
      "objection_response": "We work with Sanofi, Oscar Health, and several banks. Happy to walk through our compliance story.",
      "touch_1_subject": "Fraud platform testing",
      "touch_1_body": "Alessandro, testing fraud detection systems that process $2T+ daily has zero margin for error.\n\nIs your team spending more time maintaining existing test suites than building coverage for new fraud patterns?\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma in a similarly compliance-heavy environment.\n\nWould 15 minutes to see how that applies to payment fraud testing be useful?",
      "touch_2_call": "OPENER: Hey Alessandro, this is Rob from Testsigma, quick question about testing on the fraud payment services side at The Clearing House.\nPAIN: Fraud systems evolve constantly, which usually means test suites break faster than teams can fix them.\nBRIDGE: CRED hit 90% regression automation, 5x faster. Worth 60 seconds to see if it fits?",
      "touch_3_body": "Circling back, Alessandro.\n\nDifferent angle: Hansard cut regression from 8 weeks to 5 weeks with AI auto-heal with Testsigma. The self-healing piece was critical for them because their platform changes as often as fraud rules do.\n\nWorth a quick look?",
      "touch_4_call": "OPENER: Hey Alessandro, Rob from Testsigma, following up on the fraud platform testing at Clearing House.\nPAIN: Medibuddy automated 2,500 tests and halved maintenance, and compliance was a big driver for them too.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "TCH fraud testing",
      "touch_5_body": "Alessandro, one more thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and their testing requirements were just as compliance-heavy as payment infrastructure.\n\nIf keeping regression coverage tight while fraud patterns shift is eating your team's bandwidth, could be worth 15 minutes.\n\nWould this week or next work?",
      "touch_6_body": "Alessandro, just closing the loop.\n\nIf the timing's off, totally understand. Payments infrastructure doesn't exactly have slow seasons.\n\nDoor's open whenever.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Kishore Ramalingam",
      "first_name": "Kishore",
      "title": "Director Quality Engineering",
      "company": "Optum",
      "location": "Greater Minneapolis-St. Paul Area",
      "vertical": "Healthcare",
      "employee_count": 300000,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 3,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "UnitedHealth subsidiary serving 120M+ people. OptumRx, OptumHealth, OptumInsight divisions with massive healthcare platforms.",
      "person_detail": "Career QA professional with extensive experience. 6+ years at Optum.",
      "predicted_objection": "Security/procurement is complex",
      "objection_response": "We offer on-prem, private cloud, and hybrid. SOC2/ISO certified. A few Fortune 500s run us behind their firewall.",
      "touch_1_subject": "QE at Optum's scale",
      "touch_1_body": "Kishore, running QE at Optum means testing platforms that touch 120M+ lives across OptumRx, OptumHealth, and OptumInsight.\n\nAt that scale, is test maintenance consuming more engineering hours than new coverage development?\n\nMedibuddy automated 2,500 tests and cut maintenance 50% with Testsigma across their healthcare platform.\n\nWould 15 minutes to see how that maps to Optum's stack be useful?",
      "touch_2_call": "OPENER: Hey Kishore, this is Rob from Testsigma, quick question about QE across Optum's platform portfolio.\nPAIN: Healthcare platforms with multiple divisions usually have fragmented test suites that nobody trusts end to end.\nBRIDGE: Sanofi went from 3-day regression to 80 minutes. Worth 60 seconds?",
      "touch_3_body": "Circling back, Kishore.\n\nHansard cut regression from 8 weeks to 5 weeks with AI auto-heal with Testsigma. Their compliance requirements were similar to what Optum deals with in healthcare.\n\nWorth a quick conversation?",
      "touch_4_call": "OPENER: Hey Kishore, Rob from Testsigma, following up on the QE conversation for Optum.\nPAIN: CRED hit 90% regression automation across their platform, and their multi-product setup is similar to Optum's.\nBRIDGE: Quick chat to see how it compares?",
      "touch_5_subject": "Optum QE scale",
      "touch_5_body": "Kishore, last thought on this.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma testing across multiple platform divisions. The plain English approach meant teams across business units could write tests without deep automation expertise.\n\nIf scaling QE coverage without scaling headcount is on your radar, happy to walk through the details.\n\nWould 15 minutes work?",
      "touch_6_body": "Kishore, just closing the loop.\n\nIf the timing isn't right, totally get it. QE at Optum's scale doesn't leave a lot of spare bandwidth.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "medibuddy_scale",
        "call_1": "sanofi_speed",
        "touch_3": "hansard_regression",
        "call_2": "cred_coverage",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Kshitija Apte",
      "first_name": "Kshitija",
      "title": "Associate Director of Quality Engineering",
      "company": "Moderna",
      "location": "Atlanta Metropolitan Area",
      "vertical": "Healthcare",
      "employee_count": 3000,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 3,
      "icp_score": 9,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "mRNA biotech with digital platforms for vaccine development, clinical trial systems, and supply chain management.",
      "person_detail": "Dynamic and results-driven QE leader with over a decade of experience.",
      "predicted_objection": "Compliance requirements",
      "objection_response": "We work with Sanofi, Oscar Health, and several banks. Happy to walk through our compliance story.",
      "touch_1_subject": "Moderna's digital testing",
      "touch_1_body": "Kshitija, Moderna's digital platforms for vaccine development and clinical trial systems must have some of the tightest validation requirements in the industry.\n\nIs your team spending more time on test maintenance than expanding coverage for new capabilities?\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma while maintaining full compliance traceability.\n\nWould 15 minutes to compare their approach to Moderna's be useful?",
      "touch_2_call": "OPENER: Hey Kshitija, this is Rob from Testsigma, quick one about the QE side at Moderna's digital platforms.\nPAIN: Pharma QE teams usually spend 60%+ of their time on maintenance and compliance documentation, not new coverage.\nBRIDGE: Medibuddy automated 2,500 tests, cut maintenance 50%. Worth 60 seconds?",
      "touch_3_body": "Circling back, Kshitija.\n\nDifferent angle: Hansard cut regression from 8 weeks to 5 weeks using AI auto-heal with Testsigma. The self-healing meant their validation suite stayed current without manual rework.\n\nGiven Moderna's validation requirements, worth a quick look?",
      "touch_4_call": "OPENER: Hey Kshitija, Rob from Testsigma, following up on the digital platform QE at Moderna.\nPAIN: CRED hit 90% regression automation. Their compliance requirements weren't pharma-grade, but the approach translates.\nBRIDGE: Quick chat to see how?",
      "touch_5_subject": "Pharma QE at Moderna",
      "touch_5_body": "Kshitija, one last thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and they had similar compliance documentation requirements to what Moderna runs for their clinical and supply chain systems.\n\nIf keeping validation coverage tight while Moderna's digital platforms evolve is a challenge, could be worth a conversation.\n\nWould 15 minutes this week work?",
      "touch_6_body": "Kshitija, just closing the loop.\n\nIf this isn't the right time, totally understand. Pharma QE cycles don't exactly have downtime.\n\nDoor's always open.",
      "proof_points_used": {
        "touch_1": "medibuddy_scale",
        "call_1": "sanofi_speed",
        "touch_3": "hansard_regression",
        "call_2": "cred_coverage",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Sarat Ramineni",
      "first_name": "Sarat",
      "title": "Head of Quality Engineering & DevOps",
      "company": "DiiZen",
      "location": "United States",
      "vertical": "Tech",
      "employee_count": 100,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 3,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [
        "recent_post"
      ],
      "company_desc": "Research, design, and innovation consultancy helping organizations with Agile and Digital Transformation.",
      "person_detail": "Believes quality isn't just a gate at the end of delivery. Combines QE with DevOps leadership.",
      "predicted_objection": "Budget is tight",
      "objection_response": "Totally get it. One company your size (Spendflo) cut manual testing 50% and saw ROI in the first quarter.",
      "touch_1_subject": "QE meets DevOps",
      "touch_1_body": "Sarat, combining QE with DevOps leadership at DiiZen is an approach I don't see often, and it makes a lot of sense for a consultancy driving digital transformation.\n\nAre your client delivery teams hitting bottlenecks where testing is the last thing before go-live and the first thing to get squeezed?\n\nSpendflo cut manual testing 50% with Testsigma and saw ROI in the first quarter, and they were a similar team size.\n\nWould 15 minutes to see if it fits DiiZen's delivery model be worth it?",
      "touch_2_call": "OPENER: Hey Sarat, this is Rob from Testsigma, wanted to ask about the QE-DevOps integration you're running at DiiZen.\nPAIN: Consultancies usually have the hardest time keeping test automation consistent across different client engagements.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds to compare?",
      "touch_3_body": "Circling back, Sarat.\n\nDifferent angle: Medibuddy automated 2,500 tests and cut maintenance 50% with Testsigma. The plain English approach meant any team member could write tests, not just automation engineers.\n\nCould be relevant for DiiZen's delivery model. Worth a look?",
      "touch_4_call": "OPENER: Hey Sarat, Rob from Testsigma, following up on the QE delivery at DiiZen.\nPAIN: CRED hit 90% regression automation, 5x faster execution. For a consultancy, that kind of speed is a differentiator.\nBRIDGE: Quick chat?",
      "touch_5_subject": "DiiZen delivery speed",
      "touch_5_body": "Sarat, one more angle.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. For a consultancy like DiiZen helping clients through digital transformation, that kind of testing speed can be a competitive advantage.\n\nIf accelerating delivery timelines for clients is on your radar, happy to share more.\n\nWould 15 minutes make sense?",
      "touch_6_body": "Sarat, just closing the loop.\n\nIf the timing's off, totally get it. Happy to reconnect whenever makes sense.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Srikanth Kasula",
      "first_name": "Srikanth",
      "title": "Head of Quality Engineering",
      "company": "AEG Fuels",
      "location": "Miami, Florida",
      "vertical": "Energy",
      "employee_count": 350,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 3,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [
        "follows_company"
      ],
      "company_desc": "Aviation fuel provider serving 3,000+ locations globally. Operates fuel management systems and trip planning software.",
      "person_detail": "QA & Engineering Leader with 20+ years experience. Follows Testsigma on LinkedIn.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "Aviation fuel tech QA",
      "touch_1_body": "Srikanth, I noticed you follow Testsigma on LinkedIn, so you probably already know what we do.\n\nCurious though, with AEG Fuels running fuel management systems and trip planning software across 3,000+ locations, is the testing complexity scaling faster than the team?\n\nNagra DTV automated 2,500 tests in 8 months and went 4X faster with Testsigma, and their multi-location platform had similar complexity.\n\nWould 15 minutes to go deeper on how it works be useful?",
      "touch_2_call": "OPENER: Hey Srikanth, this is Rob from Testsigma. I see you already follow us on LinkedIn, so I wanted to connect directly.\nPAIN: Fuel management platforms serving 3,000+ locations must generate a massive test surface area, especially with trip planning layered in.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth a quick chat to go deeper?",
      "touch_3_body": "Circling back, Srikanth.\n\nSince you already follow Testsigma, figured you'd appreciate a specific number: Medibuddy automated 2,500 tests and cut maintenance 50%. Their multi-system setup was similar to AEG's.\n\nWorth a conversation?",
      "touch_4_call": "OPENER: Hey Srikanth, Rob from Testsigma, following up on the fuel management testing conversation.\nPAIN: CRED hit 90% regression automation. For platforms spanning 3,000+ locations, that kind of coverage is critical.\nBRIDGE: Quick chat to see how it maps?",
      "touch_5_subject": "AEG Fuels testing at scale",
      "touch_5_body": "Srikanth, one more thought.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. With your 20+ years in QA, you'd probably spot quickly whether the approach fits AEG's platform.\n\nWould 15 minutes to walk through a demo make sense?",
      "touch_6_body": "Srikanth, closing the loop here.\n\nSince you follow Testsigma, you'll see our updates anyway. Happy to connect directly whenever the timing feels right.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Sumeet Lakhanpal",
      "first_name": "Sumeet",
      "title": "Director of Software Engineering, Residential (myQ) | Product Engineering & Quality Transformation",
      "company": "Chamberlain Group",
      "location": "Greater Chicago Area",
      "vertical": "Tech",
      "employee_count": 1750,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 3,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Smart home/IoT leader with myQ app (14M+ daily users). Products include garage openers, smart locks, video doorbells.",
      "person_detail": "Focused on building connected products people can trust. Leads quality transformation for myQ residential platform.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "myQ testing at 14M users",
      "touch_1_body": "Sumeet, driving quality transformation for the myQ platform with 14M+ daily users means every release touches a lot of people.\n\nIs the test coverage keeping pace across the garage openers, smart locks, and video doorbells, or is the IoT device matrix outpacing automation?\n\nNagra DTV automated 2,500 tests in 8 months and went 4X faster with Testsigma across their connected device ecosystem.\n\nWould 15 minutes to compare approaches be worth it?",
      "touch_2_call": "OPENER: Hey Sumeet, this is Rob from Testsigma, quick one about the quality transformation work on myQ.\nPAIN: IoT platforms with multiple device types usually have the highest test matrix complexity I see.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds to see if it's relevant?",
      "touch_3_body": "Circling back, Sumeet.\n\nDifferent angle: Medibuddy automated 2,500 tests and cut maintenance 50% with Testsigma. The cross-platform approach is what made it work for their device ecosystem.\n\nGiven myQ's device variety, worth a quick look?",
      "touch_4_call": "OPENER: Hey Sumeet, Rob from Testsigma, following up on the myQ quality transformation.\nPAIN: CRED hit 90% regression automation, 5x faster. Their multi-platform setup had similar complexity to myQ's.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "Quality transformation at myQ",
      "touch_5_body": "Sumeet, one last thought.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. For a platform serving 14M daily users across multiple connected devices, that kind of speed matters.\n\nIf the quality transformation is still underway, could be worth seeing how Testsigma fits into the plan.\n\nWould 15 minutes this week work?",
      "touch_6_body": "Sumeet, just closing the loop.\n\nIf the quality transformation has you heads down right now, totally get it. Happy to reconnect when the timing's better.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Rafael Blanco",
      "first_name": "Rafael",
      "title": "Director Quality/Test Engineering",
      "company": "DV7 Engineering",
      "location": "East Hartford, Connecticut",
      "vertical": "Tech",
      "employee_count": 200,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 3,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [
        "recent_post"
      ],
      "company_desc": "Engineering firm for safety-critical products in medical devices, aerospace, and defense. Provides IV&V testing services.",
      "person_detail": "Leads quality and test engineering practice. Recent LinkedIn post activity.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "Safety-critical QE",
      "touch_1_body": "Rafael, running quality and test engineering for safety-critical products across medical devices, aerospace, and defense is about as high-stakes as QE gets.\n\nIs the IV&V testing process keeping pace, or is the verification backlog growing faster than the team?\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma while maintaining full audit traceability.\n\nWould 15 minutes to see how that maps to DV7's testing requirements be useful?",
      "touch_2_call": "OPENER: Hey Rafael, this is Rob from Testsigma, quick one about the IV&V testing practice at DV7 Engineering.\nPAIN: Safety-critical testing usually means regression suites that grow 3x faster than the team can maintain them.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Rafael.\n\nMedibuddy automated 2,500 tests and cut maintenance 50% with Testsigma. The plain English approach meant domain experts, not just automation engineers, could write and maintain tests.\n\nFor IV&V work, that could be a game changer. Worth a look?",
      "touch_4_call": "OPENER: Hey Rafael, Rob from Testsigma, following up on the safety-critical testing at DV7.\nPAIN: CRED hit 90% regression automation. For IV&V work, that level of coverage is what regulators want to see.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "IV&V testing at DV7",
      "touch_5_body": "Rafael, one more angle.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and their regulatory documentation requirements were comparable to safety-critical engineering.\n\nIf the verification backlog is growing while DV7's client portfolio expands, could be worth a conversation.\n\nWould 15 minutes this week make sense?",
      "touch_6_body": "Rafael, just closing the loop.\n\nSafety-critical QE doesn't slow down, so if the timing's off, totally understand.\n\nDoor's always open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Suresh Reginald",
      "first_name": "Suresh",
      "title": "Sr. Director, Quality Engineering",
      "company": "Aspen Technology",
      "location": "Lexington, Massachusetts",
      "vertical": "Tech",
      "employee_count": 4500,
      "persona_type": "QA",
      "seniority": "Sr. Director",
      "priority_score": 3,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Industrial software for process industries. Asset performance, digital grid, process simulation, manufacturing optimization.",
      "person_detail": "Nearly 15 years as Sr. Director QE at AspenTech. Deep institutional knowledge.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "AspenTech QE evolution",
      "touch_1_body": "Suresh, 15 years leading QE at AspenTech means you've watched the platform evolve from on-prem simulation tools to the cloud-based optimization suite it is today.\n\nHas the test automation kept pace with that shift, or is the legacy test debt growing alongside the new platform?\n\nHansard cut regression from 8 weeks to 5 weeks with AI auto-heal with Testsigma during their own platform modernization.\n\nWould 15 minutes to compare approaches be useful?",
      "touch_2_call": "OPENER: Hey Suresh, this is Rob from Testsigma, quick one about the QE evolution at AspenTech.\nPAIN: Industrial software that's moved to cloud usually has legacy test suites that break every time the platform updates.\nBRIDGE: Medibuddy automated 2,500 tests, cut maintenance 50%. Worth 60 seconds?",
      "touch_3_body": "Circling back, Suresh.\n\nDifferent angle: Sanofi compressed regression from 3 days to 80 minutes with Testsigma. Their platform complexity, spanning multiple industrial processes, was similar to AspenTech's.\n\nWorth a quick conversation?",
      "touch_4_call": "OPENER: Hey Suresh, Rob from Testsigma, following up on the QE side at AspenTech.\nPAIN: CRED hit 90% regression automation. For industrial software with as many modules as AspenTech, that coverage level matters.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "15 years of AspenTech QE",
      "touch_5_body": "Suresh, one last thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma specifically because the AI self-healing kept legacy and modern test suites stable simultaneously.\n\nWith AspenTech's platform spanning process simulation, asset performance, and manufacturing optimization, that kind of stability might be relevant.\n\nWould 15 minutes work?",
      "touch_6_body": "Suresh, just closing the loop.\n\nAfter 15 years at AspenTech, you've probably seen every testing pitch there is. If now isn't the right time, totally understand.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Juan Carlos Torres",
      "first_name": "Juan Carlos",
      "title": "VP of Software Engineering",
      "company": "Flimp",
      "location": "Houston, Texas",
      "vertical": "Tech",
      "employee_count": 100,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 3,
      "icp_score": 6,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [
        "recently_promoted"
      ],
      "company_desc": "HR benefits communication platform with AI-powered tools. Serves 1,600+ corporate clients including Fortune 500.",
      "person_detail": "Recently promoted to VP SE. 4 years at Flimp prior to promotion.",
      "predicted_objection": "Too early, still assessing",
      "objection_response": "Makes sense. A lot of QA leaders in their first 90 days use our free trial to benchmark what's possible before committing.",
      "touch_1_subject": "HR platform testing",
      "touch_1_body": "Juan Carlos, congrats on the VP promotion at Flimp.\n\nWith 1,600+ corporate clients relying on the benefits communication platform, how's the QA coverage looking across the AI-powered tools?\n\nSpendflo cut manual testing 50% with Testsigma and saw ROI in the first quarter, and they were at a similar stage.\n\nWould 15 minutes to see if it's relevant to Flimp's current setup be useful?",
      "touch_2_call": "OPENER: Hey Juan Carlos, this is Rob from Testsigma, congrats on the VP promotion at Flimp.\nPAIN: HR platforms with 1,600+ clients usually hit the point where every release needs more regression testing than the last.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Juan Carlos.\n\nMedibuddy automated 2,500 tests and cut maintenance 50% with Testsigma. Their multi-tenant platform had similar complexity to what Flimp serves across 1,600+ clients.\n\nWorth a conversation?",
      "touch_4_call": "OPENER: Hey Juan Carlos, Rob from Testsigma, following up on the testing at Flimp.\nPAIN: CRED hit 90% regression automation, 5x faster. For a growing SaaS platform, that kind of speed is critical.\nBRIDGE: Quick chat?",
      "touch_5_subject": "Flimp QA at scale",
      "touch_5_body": "Juan Carlos, one more thought.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. For an HR platform serving Fortune 500 clients, fast regression cycles mean faster feature delivery.\n\nIf scaling QA alongside Flimp's client growth is on your radar, happy to walk through the details.\n\nWould 15 minutes make sense?",
      "touch_6_body": "Juan Carlos, closing the loop.\n\nIf the new VP role has you focused elsewhere right now, totally get it. Happy to reconnect later.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Ajay Sikha",
      "first_name": "Ajay",
      "title": "Vice President of Software Engineering",
      "company": "Cantaloupe Inc",
      "location": "Tampa, Florida",
      "vertical": "Tech",
      "employee_count": 500,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 3,
      "icp_score": 6,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [
        "recently_hired"
      ],
      "company_desc": "Self-service commerce tech providing payment processing, POS, and kiosk management for vending and autonomous retail.",
      "person_detail": "Forward-thinking technology leader with 25+ years experience. Just joined Cantaloupe 3 months ago.",
      "predicted_objection": "Too early, still assessing",
      "objection_response": "Makes sense. A lot of QA leaders in their first 90 days use our free trial to benchmark what's possible before committing.",
      "touch_1_subject": "New to Cantaloupe?",
      "touch_1_body": "Ajay, a few months into the VP SE role at Cantaloupe, you're probably getting a full picture of the testing landscape across the payment processing, POS, and kiosk systems.\n\nIs the automation coverage where you'd want it, or is there a gap between what's tested and what's shipping?\n\nCRED hit 90% regression automation and 5x faster execution with Testsigma during a similar assessment period.\n\nWould 15 minutes to benchmark against what you're seeing be useful?",
      "touch_2_call": "OPENER: Hey Ajay, this is Rob from Testsigma. You're a few months into Cantaloupe, figured this might be good timing.\nPAIN: New engineering leaders usually find the test automation is the first thing that needs an upgrade.\nBRIDGE: Spendflo cut manual testing 50%, saw ROI first quarter. Worth 60 seconds?",
      "touch_3_body": "Circling back, Ajay.\n\nDifferent angle: Hansard cut regression from 8 weeks to 5 weeks with AI auto-heal with Testsigma. A lot of QA leaders in their first 6 months use our free trial to benchmark what's possible before committing.\n\nWorth a quick look?",
      "touch_4_call": "OPENER: Hey Ajay, Rob from Testsigma, following up on the testing landscape at Cantaloupe.\nPAIN: Medibuddy automated 2,500 tests, cut maintenance 50%. That was during an assessment and rebuild similar to what you're probably going through.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "Cantaloupe QA assessment",
      "touch_5_body": "Ajay, one more thought.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. For a payments and kiosk platform like Cantaloupe's, fast regression means faster feature rollouts to merchants.\n\nIf you're still assessing the QA stack as part of your first year plan, could be worth a conversation.\n\nWould 15 minutes make sense?",
      "touch_6_body": "Ajay, closing the loop.\n\nIf the first few months have you focused on bigger priorities right now, totally get it.\n\nDoor's open when the timing works.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Debbie Almeida",
      "first_name": "Debbie",
      "title": "Director of IT Quality Assurance",
      "company": "loanDepot",
      "location": "Lake Forest, California",
      "vertical": "FinTech",
      "employee_count": 4000,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 3,
      "icp_score": 9,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Digital mortgage lending platform. One of largest non-bank retail mortgage lenders in the US.",
      "person_detail": "Over 10 years leading IT QA at loanDepot. Deep institutional knowledge of mortgage tech systems.",
      "predicted_objection": "Compliance requirements",
      "objection_response": "We work with Sanofi, Oscar Health, and several banks. Happy to walk through our compliance story.",
      "touch_1_subject": "Mortgage platform QA",
      "touch_1_body": "Debbie, running IT QA at loanDepot for over a decade means you've tested through every rate cycle and regulatory change the mortgage industry has thrown at you.\n\nIs the test automation keeping up with how fast the digital lending platform needs to evolve right now?\n\nCRED hit 90% regression automation and 5x faster execution with Testsigma in a similarly fast-moving fintech environment.\n\nWould 15 minutes to compare approaches be useful?",
      "touch_2_call": "OPENER: Hey Debbie, this is Rob from Testsigma, quick one about the QA side at loanDepot's digital lending platform.\nPAIN: Mortgage tech has to move fast with rates and regs, but regression suites usually can't keep up.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Debbie.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. Their compliance requirements were comparable to what mortgage lending demands.\n\nGiven loanDepot's regulatory environment, worth a quick look?",
      "touch_4_call": "OPENER: Hey Debbie, Rob from Testsigma, following up on the digital lending testing at loanDepot.\nPAIN: Medibuddy automated 2,500 tests, cut maintenance 50%. Compliance-driven teams usually see the biggest ROI from self-healing.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "loanDepot QA evolution",
      "touch_5_body": "Debbie, one more thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and their financial services testing requirements were just as compliance-heavy as mortgage lending.\n\nAfter 10+ years leading QA at loanDepot, you'd probably spot quickly whether the approach fits. Would 15 minutes be worth it?",
      "touch_6_body": "Debbie, just closing the loop.\n\nMortgage lending doesn't have slow seasons, so if the timing's off, totally understand.\n\nDoor's always open.",
      "proof_points_used": {
        "touch_1": "cred_coverage",
        "call_1": "hansard_regression",
        "touch_3": "medibuddy_scale",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Alex Teymurazov",
      "first_name": "Alex",
      "title": "Director, Quality Engineering and Automation",
      "company": "Shutterfly",
      "location": "San Francisco Bay Area",
      "vertical": "E-Commerce",
      "employee_count": 8269,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 2,
      "icp_score": 6,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "E-commerce photo platform with 600+ customizable products. Brands include Shutterfly, Snapfish, Spoonflower, Lifetouch.",
      "person_detail": "Over a decade leading QE organizations through transformation. Oversees engineering and automation.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "QE across 600 products",
      "touch_1_body": "Alex, leading QE transformation across Shutterfly, Snapfish, Spoonflower, and Lifetouch means the test matrix is enormous, especially with 600+ customizable products.\n\nIs the automation covering the full product catalog, or are there corners where manual testing is still the fallback?\n\nMedibuddy automated 2,500 tests and cut maintenance 50% with Testsigma across a similarly large product surface area.\n\nWould 15 minutes to compare approaches be useful?",
      "touch_2_call": "OPENER: Hey Alex, this is Rob from Testsigma, quick one about QE across the Shutterfly brand portfolio.\nPAIN: Multi-brand e-commerce platforms usually have the highest test matrix complexity I see, especially with customizable products.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Alex.\n\nCRED hit 90% regression automation and 5x faster execution with Testsigma. Their multi-platform setup is similar to how Shutterfly manages testing across multiple brands.\n\nWorth a conversation?",
      "touch_4_call": "OPENER: Hey Alex, Rob from Testsigma, following up on the QE transformation at Shutterfly.\nPAIN: Sanofi went 3 days to 80 minutes on regression. With 600+ products, fast regression is everything.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "Shutterfly QE transformation",
      "touch_5_body": "Alex, one more thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma across their multi-brand platform. The AI self-healing meant tests survived product catalog changes without manual rework.\n\nAfter a decade driving QE transformation, you'd probably spot quickly whether the approach fits Shutterfly's setup.\n\nWould 15 minutes work?",
      "touch_6_body": "Alex, closing the loop.\n\nIf the timing isn't right with the QE transformation in progress, totally get it.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Peter Jin",
      "first_name": "Peter",
      "title": "Director, Quality Engineering",
      "company": "The Wendy's Company",
      "location": "Dublin, Ohio",
      "vertical": "Retail",
      "employee_count": 7000,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 2,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [
        "recent_post"
      ],
      "company_desc": "QSR operating 7,000+ locations. Digital innovation includes FreshAI drive-thru, self-order kiosks, mobile ordering platform.",
      "person_detail": "Core mission is to elevate the standard of Quality. Leads QE for digital platforms.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "FreshAI testing",
      "touch_1_body": "Peter, elevating quality standards across Wendy's digital platforms, from FreshAI drive-thru to self-order kiosks to mobile ordering, is a lot of surface area to cover.\n\nIs the QE team spending more time keeping existing tests stable or building coverage for the newer AI-powered features?\n\nNagra DTV automated 2,500 tests in 8 months and went 4X faster with Testsigma across their multi-platform setup.\n\nWould 15 minutes to see how that maps to Wendy's digital stack be useful?",
      "touch_2_call": "OPENER: Hey Peter, this is Rob from Testsigma, quick one about the QE side at Wendy's digital platforms.\nPAIN: QSR digital with kiosks, mobile, and AI drive-thru means every release has to work on multiple device types.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Peter.\n\nDifferent angle: Medibuddy automated 2,500 tests and cut maintenance 50% with Testsigma. The cross-platform piece was key, similar to testing across Wendy's kiosks, mobile, and FreshAI.\n\nWorth a quick look?",
      "touch_4_call": "OPENER: Hey Peter, Rob from Testsigma, following up on the digital QE at Wendy's.\nPAIN: CRED hit 90% regression automation. For a QSR rolling out AI across 7,000+ locations, coverage is everything.\nBRIDGE: Quick chat?",
      "touch_5_subject": "Wendy's digital QE",
      "touch_5_body": "Peter, one last thought.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. For Wendy's, with FreshAI rolling out and mobile ordering scaling, fast regression means faster feature rollouts to 7,000+ locations.\n\nIf keeping QE pace with digital innovation is the challenge, happy to walk through how it worked.\n\nWould 15 minutes make sense?",
      "touch_6_body": "Peter, closing the loop.\n\nIf the digital rollout has you heads down right now, totally get it.\n\nDoor's open whenever.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Valerie Terrell",
      "first_name": "Valerie",
      "title": "Director of Quality Engineering",
      "company": "Travelers",
      "location": "Stone Mountain, Georgia",
      "vertical": "Insurance",
      "employee_count": 34000,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 2,
      "icp_score": 6,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Major property and casualty insurer with digital customer portals, claims management, and underwriting platforms.",
      "person_detail": "Experienced QA Director and Enterprise Quality Management advocate. Works with Salesforce CRM systems.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. A lot of teams we work with had salesforce too. The gap they kept hitting was maintenance overhead when UI changes frequently. Worth comparing?",
      "touch_1_subject": "Travelers QE + Salesforce",
      "touch_1_body": "Valerie, running quality engineering at Travelers across customer portals, claims management, and Salesforce CRM is a lot of moving pieces.\n\nIs the Salesforce testing specifically creating headaches? That's usually the spot where traditional automation tools break the most.\n\nHansard cut regression from 8 weeks to 5 weeks with AI auto-heal with Testsigma, and Salesforce testing was a big chunk of their suite.\n\nWould 15 minutes to see how that compares be useful?",
      "touch_2_call": "OPENER: Hey Valerie, this is Rob from Testsigma, quick one about the QE side at Travelers, specifically the Salesforce testing.\nPAIN: Salesforce releases 3 times a year and breaks locators every time. Most automation tools can't keep up.\nBRIDGE: Medibuddy cut maintenance 50% with self-healing. Worth 60 seconds?",
      "touch_3_body": "Circling back, Valerie.\n\nDifferent angle: Sanofi compressed regression from 3 days to 80 minutes with Testsigma. Their enterprise complexity, spanning claims and CRM, was similar to Travelers.\n\nWorth a conversation?",
      "touch_4_call": "OPENER: Hey Valerie, Rob from Testsigma, following up on the enterprise QM at Travelers.\nPAIN: CRED hit 90% regression automation. For insurance with claims, underwriting, and CRM, that coverage changes the game.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "Enterprise QM at Travelers",
      "touch_5_body": "Valerie, one more thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and they had a similar stack: customer portals, internal tools, and Salesforce CRM all needing regression coverage.\n\nIf the Salesforce testing is the bottleneck, could be worth 15 minutes to see how the self-healing handles it.",
      "touch_6_body": "Valerie, just closing the loop.\n\nInsurance QE doesn't exactly slow down. If the timing's off, totally understand.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Pradgnya Kulkarni",
      "first_name": "Pradgnya",
      "title": "Director QA Engineering",
      "company": "Wurl",
      "location": "United States",
      "vertical": "Media",
      "employee_count": 200,
      "persona_type": "QA",
      "seniority": "Director",
      "priority_score": 2,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "CTV distribution and monetization platform with AI-powered advertising. Products: FAST Pass, AdPool, ContentDiscovery.",
      "person_detail": "Overseeing Wurl's QA Engineering team. Team has become a beacon of excellence.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "CTV platform testing",
      "touch_1_body": "Pradgnya, building a QA team that's become a beacon of excellence at Wurl is impressive, especially across FAST Pass, AdPool, and ContentDiscovery.\n\nIs the test coverage keeping pace with how fast CTV ad tech moves, or is the AI-powered side outpacing automation?\n\nNagra DTV automated 2,500 tests in 8 months and went 4X faster with Testsigma across their streaming and media platform.\n\nWould 15 minutes to see how that maps to Wurl's stack be worth it?",
      "touch_2_call": "OPENER: Hey Pradgnya, this is Rob from Testsigma, quick one about the QA engineering at Wurl's CTV platform.\nPAIN: CTV ad tech with real-time bidding and content discovery usually has the fastest-changing test surface area in media.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Pradgnya.\n\nDifferent angle: Medibuddy automated 2,500 tests and cut maintenance 50% with Testsigma. Their platform evolved as fast as CTV ad tech does.\n\nGiven Wurl's pace, worth a quick look?",
      "touch_4_call": "OPENER: Hey Pradgnya, Rob from Testsigma, following up on the CTV platform testing at Wurl.\nPAIN: CRED hit 90% regression automation, 5x faster. For ad tech with real-time requirements, speed is everything.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "Wurl QA at CTV speed",
      "touch_5_body": "Pradgnya, one more thought.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. For a CTV platform like Wurl where FAST Pass and AdPool need to work flawlessly for advertisers, fast regression is a competitive advantage.\n\nIf keeping QA pace with CTV innovation is the challenge, happy to share how Nagra DTV solved it.\n\nWould 15 minutes work?",
      "touch_6_body": "Pradgnya, closing the loop.\n\nCTV doesn't slow down, so if now isn't the right time, totally get it.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "nagra_api",
        "call_1": "hansard_regression",
        "touch_3": "medibuddy_scale",
        "call_2": "cred_coverage",
        "touch_5": "sanofi_speed"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Daniel DiBartolomeo",
      "first_name": "Daniel",
      "title": "VP, Software Engineering",
      "company": "Cengage",
      "location": "Delmar, New York",
      "vertical": "Tech",
      "employee_count": 4500,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 2,
      "icp_score": 6,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Global edtech providing digital learning platforms, digital textbooks, and e-learning tools from middle school through graduate level.",
      "person_detail": "IT leader with enterprise info architecture experience. 12+ years at Cengage across roles.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "EdTech platform testing",
      "touch_1_body": "Daniel, 12+ years at Cengage means you've seen the shift from textbooks to digital learning platforms firsthand.\n\nIs the test automation keeping pace with how fast the e-learning tools are evolving, or is there still a gap between what's shipped and what's covered?\n\nMedibuddy automated 2,500 tests and cut maintenance 50% with Testsigma across a multi-product digital platform.\n\nWould 15 minutes to compare approaches be worth it?",
      "touch_2_call": "OPENER: Hey Daniel, this is Rob from Testsigma, quick one about the testing side at Cengage's digital learning platform.\nPAIN: EdTech platforms that serve K-12 through graduate school usually have the widest browser/device matrix to test against.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Daniel.\n\nDifferent angle: CRED hit 90% regression automation and 5x faster execution with Testsigma. Their multi-product platform had similar complexity to Cengage's learning stack.\n\nWorth a conversation?",
      "touch_4_call": "OPENER: Hey Daniel, Rob from Testsigma, following up on the digital platform testing at Cengage.\nPAIN: Sanofi went 3 days to 80 minutes on regression. For edtech launching features before each semester, speed matters.\nBRIDGE: Quick chat?",
      "touch_5_subject": "Cengage digital testing",
      "touch_5_body": "Daniel, one more thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and their digital platform served a similarly broad user base.\n\nIf keeping test coverage tight while Cengage's e-learning tools evolve is something your team deals with, could be worth a look.\n\nWould 15 minutes this week make sense?",
      "touch_6_body": "Daniel, closing the loop.\n\nAfter 12 years at Cengage, you've probably evaluated a lot of tools. If now isn't the right time, totally get it.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Jake McGraw",
      "first_name": "Jake",
      "title": "VP of Software Engineering, Worldpay for Platforms, Payrix",
      "company": "Worldpay",
      "location": "New York City Metropolitan Area",
      "vertical": "FinTech",
      "employee_count": 8500,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 2,
      "icp_score": 7,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [
        "recent_post"
      ],
      "company_desc": "Global payments company processing in 146 countries and 135 currencies. Payment processing, merchant services, fraud prevention.",
      "person_detail": "Building fast moving engineering teams, driving culture of reliability at scale.",
      "predicted_objection": "Compliance requirements",
      "objection_response": "We work with Sanofi, Oscar Health, and several banks. Happy to walk through our compliance story.",
      "touch_1_subject": "Payments reliability",
      "touch_1_body": "Jake, driving a culture of reliability at scale across Worldpay's platform, processing payments in 146 countries and 135 currencies, means testing can't be an afterthought.\n\nIs the automation coverage matching the pace your engineering teams are shipping at?\n\nCRED hit 90% regression automation and 5x faster execution with Testsigma in a similar fast-moving fintech environment.\n\nWould 15 minutes to see how that maps to the Payrix platform be useful?",
      "touch_2_call": "OPENER: Hey Jake, this is Rob from Testsigma, quick one about reliability at scale on the Worldpay platform.\nPAIN: Global payments processing across 146 countries means every regression cycle has to cover currency, locale, and compliance variations.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Jake.\n\nDifferent angle: Sanofi compressed regression from 3 days to 80 minutes with Testsigma. For a payments platform processing in 135 currencies, that kind of speed matters.\n\nWorth a quick look?",
      "touch_4_call": "OPENER: Hey Jake, Rob from Testsigma, following up on the reliability culture at Worldpay.\nPAIN: Medibuddy automated 2,500 tests, cut maintenance 50%. That's the kind of reduction that lets teams focus on building instead of fixing.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "Worldpay test coverage",
      "touch_5_body": "Jake, one more thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma across their global platform. The self-healing meant their tests survived rapid UI and API changes without manual intervention.\n\nIf building reliable testing at the pace Worldpay ships is a priority, happy to walk through how it worked.\n\nWould 15 minutes this week work?",
      "touch_6_body": "Jake, closing the loop.\n\nGlobal payments doesn't slow down. If the timing's off, totally understand.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "cred_coverage",
        "call_1": "hansard_regression",
        "touch_3": "medibuddy_scale",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Roberto Dorich",
      "first_name": "Roberto",
      "title": "Vice President, Software Development",
      "company": "FORMULATRIX",
      "location": "Greater Boston",
      "vertical": "Tech",
      "employee_count": 200,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 2,
      "icp_score": 6,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [
        "recent_post"
      ],
      "company_desc": "Laboratory automation for drug discovery. ROVER platform, STACK system, Rock Maker LIMS software.",
      "person_detail": "IT leader passionate about solving business problems. 17+ years at FORMULATRIX.",
      "predicted_objection": "We already have a tool",
      "objection_response": "Totally fair. The gap most teams hit is maintenance when UI changes. Plain English tests + AI self-healing means 90% less upkeep. Worth a quick look?",
      "touch_1_subject": "Lab automation testing",
      "touch_1_body": "Roberto, 17+ years building FORMULATRIX's lab automation software means you've watched the ROVER platform, STACK system, and Rock Maker evolve through a lot of iterations.\n\nIs the testing infrastructure keeping pace with how fast drug discovery workflows are changing?\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma, and their life sciences platform complexity was similar.\n\nWould 15 minutes to compare approaches be useful?",
      "touch_2_call": "OPENER: Hey Roberto, this is Rob from Testsigma, quick one about the testing side at FORMULATRIX.\nPAIN: Lab automation software with hardware integration usually has the most complex test matrix I see.\nBRIDGE: Medibuddy automated 2,500 tests, cut maintenance 50%. Worth 60 seconds?",
      "touch_3_body": "Circling back, Roberto.\n\nHansard cut regression from 8 weeks to 5 weeks with AI auto-heal with Testsigma. The self-healing meant their tests survived platform changes without manual rework.\n\nGiven FORMULATRIX's platform evolution, worth a quick look?",
      "touch_4_call": "OPENER: Hey Roberto, Rob from Testsigma, following up on the lab automation testing at FORMULATRIX.\nPAIN: CRED hit 90% regression automation. For products like ROVER and Rock Maker, coverage is critical.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "FORMULATRIX platform QA",
      "touch_5_body": "Roberto, one last thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and they had a similar challenge: multiple software products serving different parts of one industry.\n\nAfter 17 years building FORMULATRIX's platform, you'd probably spot quickly whether the approach fits.\n\nWould 15 minutes make sense?",
      "touch_6_body": "Roberto, closing the loop.\n\nIf the timing's off, totally understand. Drug discovery software doesn't have slow seasons.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Chris Holden",
      "first_name": "Chris",
      "title": "Vice President Cloud Engineering and DevOps",
      "company": "Waystar",
      "location": "Roswell, Georgia",
      "vertical": "Healthcare",
      "employee_count": 1500,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 2,
      "icp_score": 8,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Cloud-based healthcare revenue cycle management with AI. Serves 30,000 clients including major health systems. Integrates with Epic, Cerner, Meditech.",
      "person_detail": "Proven track record building SDLC systems. Leads cloud engineering and DevOps.",
      "predicted_objection": "Compliance requirements",
      "objection_response": "We work with Sanofi, Oscar Health, and several banks. Happy to walk through our compliance story.",
      "touch_1_subject": "RCM platform testing",
      "touch_1_body": "Chris, building SDLC systems for Waystar's revenue cycle management platform, with 30,000 clients and integrations into Epic, Cerner, and Meditech, means the testing surface area is enormous.\n\nAre the integration tests keeping pace, or is every EHR update breaking something downstream?\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma in a similarly integration-heavy healthcare environment.\n\nWould 15 minutes to compare be useful?",
      "touch_2_call": "OPENER: Hey Chris, this is Rob from Testsigma, quick one about testing across Waystar's EHR integrations.\nPAIN: Healthcare RCM with Epic, Cerner, and Meditech integrations means every partner update is a potential regression.\nBRIDGE: Medibuddy automated 2,500 tests, cut maintenance 50%. Worth 60 seconds?",
      "touch_3_body": "Circling back, Chris.\n\nHansard cut regression from 8 weeks to 5 weeks with AI auto-heal with Testsigma. The self-healing handled exactly the kind of locator breakage that EHR integrations cause.\n\nWorth a quick conversation?",
      "touch_4_call": "OPENER: Hey Chris, Rob from Testsigma, following up on the RCM platform testing at Waystar.\nPAIN: CRED hit 90% regression automation. For healthcare serving 30,000 clients, that coverage is table stakes.\nBRIDGE: Quick chat to compare?",
      "touch_5_subject": "Waystar integration testing",
      "touch_5_body": "Chris, one more thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and their integration testing complexity was comparable to Waystar's multi-EHR landscape.\n\nIf keeping integration tests stable across Epic, Cerner, and Meditech is eating engineering hours, could be worth a look.\n\nWould 15 minutes work?",
      "touch_6_body": "Chris, closing the loop.\n\nHealthcare RCM never slows down. If now's not the right time, totally understand.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "medibuddy_scale",
        "call_1": "sanofi_speed",
        "touch_3": "hansard_regression",
        "call_2": "cred_coverage",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Khanh Tran",
      "first_name": "Khanh",
      "title": "Vice President of Software Engineering",
      "company": "Hussle",
      "location": "Santa Ana, California",
      "vertical": "Tech",
      "employee_count": 100,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 2,
      "icp_score": 6,
      "personalization_score": 3,
      "ab_group": "B",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Direct sales enablement platform with AI-powered guidance, live selling, and performance analytics.",
      "person_detail": "VP of Software Engineering leading platform development.",
      "predicted_objection": "Budget is tight",
      "objection_response": "Totally get it. One company your size (Spendflo) cut manual testing 50% and saw ROI in the first quarter.",
      "touch_1_subject": "Sales platform testing",
      "touch_1_body": "Khanh, building the engineering side at Hussle with AI-powered guidance, live selling, and performance analytics means the platform is evolving fast.\n\nAt a smaller team, is testing getting squeezed to keep up with feature delivery, or is automation holding?\n\nSpendflo cut manual testing 50% with Testsigma and saw ROI in the first quarter. They were a similar team size.\n\nWould 15 minutes to see if the approach fits Hussle be useful?",
      "touch_2_call": "OPENER: Hey Khanh, this is Rob from Testsigma, quick one about the engineering side at Hussle.\nPAIN: AI-powered platforms at a startup scale usually mean the feature velocity outpaces test automation.\nBRIDGE: Hansard cut regression 8 weeks to 5 weeks. Worth 60 seconds?",
      "touch_3_body": "Circling back, Khanh.\n\nCRED hit 90% regression automation and 5x faster execution with Testsigma. Their AI-powered platform was evolving at a pace similar to Hussle's.\n\nWorth a quick look?",
      "touch_4_call": "OPENER: Hey Khanh, Rob from Testsigma, following up on the testing at Hussle.\nPAIN: Medibuddy automated 2,500 tests, cut maintenance 50%. For smaller teams, that's the difference between shipping and testing manually.\nBRIDGE: Quick chat?",
      "touch_5_subject": "Hussle QA at startup speed",
      "touch_5_body": "Khanh, one more thought.\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma. The plain English approach meant engineers wrote tests without needing dedicated QA headcount.\n\nFor a team Hussle's size, that could be the difference. Would 15 minutes make sense?",
      "touch_6_body": "Khanh, closing the loop.\n\nStartup life is busy. If now's not the right time, totally get it.\n\nDoor's open.",
      "proof_points_used": {
        "touch_1": "hansard_regression",
        "call_1": "medibuddy_scale",
        "touch_3": "cred_coverage",
        "call_2": "sanofi_speed",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    },
    {
      "name": "Dave Peticolas",
      "first_name": "Dave",
      "title": "VP of Software Engineering",
      "company": "Natera",
      "location": "Portland, Oregon",
      "vertical": "Healthcare",
      "employee_count": 2500,
      "persona_type": "VP Eng",
      "seniority": "VP",
      "priority_score": 2,
      "icp_score": 8,
      "personalization_score": 3,
      "ab_group": "A",
      "ab_variable": "pain_hook",
      "signals": [],
      "company_desc": "Clinical genetic testing using cfDNA technology. Diagnostic platforms for women's health, oncology, and organ health.",
      "person_detail": "Enjoys making useful things that work well. Leads software engineering.",
      "predicted_objection": "Compliance requirements",
      "objection_response": "We work with Sanofi, Oscar Health, and several banks. Happy to walk through our compliance story.",
      "touch_1_subject": "Genetic testing platform QA",
      "touch_1_body": "Dave, building software for clinical genetic testing at Natera means the platform has to be bulletproof, especially across women's health, oncology, and organ health diagnostics.\n\nIs the test coverage keeping up with how fast the diagnostic platform evolves, or is there a gap?\n\nSanofi compressed regression from 3 days to 80 minutes with Testsigma in a comparable clinical environment.\n\nWould 15 minutes to see how that maps to Natera's stack be useful?",
      "touch_2_call": "OPENER: Hey Dave, this is Rob from Testsigma, quick one about the software engineering side at Natera.\nPAIN: Clinical diagnostic platforms have some of the strictest validation requirements, which means test suites grow fast.\nBRIDGE: Medibuddy automated 2,500 tests, cut maintenance 50%. Worth 60 seconds?",
      "touch_3_body": "Circling back, Dave.\n\nHansard cut regression from 8 weeks to 5 weeks with AI auto-heal with Testsigma. Their validation requirements were similar to what clinical diagnostics demands.\n\nGiven Natera's compliance environment, worth a quick look?",
      "touch_4_call": "OPENER: Hey Dave, Rob from Testsigma, following up on the diagnostic platform testing at Natera.\nPAIN: CRED hit 90% regression automation. For clinical platforms spanning oncology to women's health, coverage isn't optional.\nBRIDGE: Quick chat?",
      "touch_5_subject": "Natera platform QA",
      "touch_5_body": "Dave, one last thought.\n\nA Fortune 100 company saw 3X productivity increase with Testsigma, and their platform had comparable compliance and validation requirements to clinical diagnostics.\n\nIf keeping test coverage tight across Natera's diagnostic portfolio is a challenge, could be worth 15 minutes.\n\nWould this week work?",
      "touch_6_body": "Dave, closing the loop.\n\nClinical diagnostics doesn't have downtime. If now isn't the right moment, totally understand.\n\nDoor's always open.",
      "proof_points_used": {
        "touch_1": "medibuddy_scale",
        "call_1": "sanofi_speed",
        "touch_3": "hansard_regression",
        "call_2": "cred_coverage",
        "touch_5": "fortune100_productivity"
      },
      "qc_passed": true,
      "qc_score": "10/10"
    }
  ]
}