{"version": "1", "run": {"name": "Batch 1 - Feb 2026 Prospects", "batch_number": 1, "batch_date": "2026-02-19", "ab_variable": "Pain hook: Group A = Maintenance angle, Group B = Velocity angle", "total_prospects": 50, "source": "sales_navigator_export"}, "prospects": [{"id": 1, "name": "Olga Manuylova", "title": "Director QA Eng", "company": "AlfaBit Group", "vertical": "FinTech", "persona": "QA", "key_detail": "19+ years testing, led 75+ QAs, 60+ projects, AI-powered testing, ex-Deutsche Bank, ex-Luxoft", "company_detail": "Payments and crypto trading platform", "linkedin": "linkedin.com/in/olga-manuylova", "employee_count": 500, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quick question re: AlfaBit Group", "touch_1_body": "Been following your work heading up QA at AlfaBit Group - the scale of your team there caught my attention.\n\nEvery time compliance rules or fraud detection logic changes at AlfaBit Group, the regression surface probably expands.\n\nCRED faced the same challenge. By automating smarter, they went from 90% regression automation to 5x faster execution. Game-changer for their velocity.\n\nLet me know if this feels like something worth 15 minutes to discuss.", "touch_3": "One more angle I didn't mention - thought of a different proof point: CRED got 90% regression automation down to 5x faster execution. Might be more relevant to your situation. Would be happy to dig deeper if it's relevant to what you're working on.", "touch_6": "Hey Olga, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Olga, this is Rob from Testsigma - I noticed you're heading up QA strategy at AlfaBit Group.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at AlfaBit Group's velocity is probably steep.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Olga, this is Rob from Testsigma - I noticed you're heading up QA strategy at AlfaBit Group.\nAPI-heavy platforms like AlfaBit Group's mean test brittleness when integrations evolve.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 2, "name": "Indu Thomas", "title": "Sr Director Quality Eng", "company": "TetraScience", "vertical": "Healthcare", "persona": "QA", "key_detail": "Extensive QE & ops experience, joined March 2024", "company_detail": "Life sciences data cloud SaaS platform", "linkedin": "linkedin.com/in/indu-thomas-641752", "employee_count": 800, "ab_group": "A - Maintenance angle", "touch_1_subject": "Testing at TetraScience", "touch_1_body": "Your role building QA infrastructure at TetraScience across 800 employees is impressive.\n\nRegulated platforms like TetraScience's need bulletproof coverage, but manual maintenance is eating into your velocity.\n\nWe helped Medibuddy solve this exact problem. 2,500 tests automated meant they could cut 50% maintenance cut off their regression cycles. Freed up the whole team.\n\nCurious what you think. If it resonates, let's grab a time to talk through it. That's especially true for life sciences data cloud saas platform where every test that breaks costs time.", "touch_3": "Wanted to loop back with something - came across another angle: Medibuddy's 2,500 tests automated dropped to 50% maintenance cut. Wondering if that resonates more. No pressure, but if this is something you're wrestling with, let's talk. For life sciences platforms especially, that kind of reduction in maintenance drag frees up your team to focus on coverage expansion.", "touch_6": "Hey Indu, wrapping up my outreach. If scaling QA becomes urgent, reach out. Otherwise, best of luck with your current focus. Wishing you and your team the best with extensive qe & ops experience, joined march 2024.", "call_snippet_1": "Hey Indu, this is Rob from Testsigma - I noticed you're heading up QA strategy at TetraScience.\nRegulated platforms like TetraScience's need bulletproof coverage, but manual maintenance is eating into your velocity.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Indu, this is Rob from Testsigma - I noticed you're heading up QA strategy at TetraScience.\nCare coordination platforms generate complex test cases that fragment across your team.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 3, "name": "Rafi Zeituni", "title": "Director of QA", "company": "EX.CO", "vertical": "SaaS", "persona": "QA", "key_detail": "Ex-CME Group Head QA, Ex-Traiana Director QA, post-trade processing expert", "company_detail": "Content experience platform, high-transaction volume", "linkedin": "", "employee_count": 400, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quick question re: EX.CO", "touch_1_body": "Your role building QA infrastructure at EX.CO across 400 employees is impressive.\n\nMulti-tenant platforms like EX.CO's have to regression test across customer configs - that's a matrix problem.\n\nSpendflo was drowning in test maintenance until they automated their regression cycles. 50% manual testing became cut in first quarter. Huge shift.\n\nCurious what you think. If it resonates, let's grab a time to talk through it. Curious how this lands with ex-cme group head qa, ex-traiana director qa, post-trade processing expert right now.", "touch_3": "One more angle I didn't mention - realized Spendflo tackled this from a different angle. 50% manual testing became cut in first quarter. Worth comparing notes? Thought it might be worth exploring together. If not, no worries. Given your post-trade processing background, that efficiency gain might be exactly what you need when scaling.", "touch_6": "Hey Rafi, I'll close the loop here. Totally get if the timing isn't right. Just wanted to make sure you had the option. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Rafi, this is Rob from Testsigma - you're doing interesting work on the Director of QA side at EX.CO.\nAs EX.CO scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Rafi, this is Rob from Testsigma - you're doing interesting work on the Director of QA side at EX.CO.\nMulti-tenant platforms like EX.CO's have to regression test across customer configs - that's a matrix problem.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "No LinkedIn profile found via web search"}, {"id": 4, "name": "Fora Shah", "title": "Director Quality Eng", "company": "ClearCompany", "vertical": "SaaS", "persona": "QA", "key_detail": "Director of QE at HR talent management SaaS, since April 2023", "company_detail": "HR talent management platform", "linkedin": "", "employee_count": 600, "ab_group": "A - Maintenance angle", "touch_1_subject": "ClearCompany QA cycles", "touch_1_body": "Been following your work heading up QA at ClearCompany - the scale of your team there caught my attention.\n\nAs ClearCompany scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\n\nSpendflo hit similar walls - they got 50% manual testing down to cut in first quarter. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nNot sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_3": "Circling back quick - thought of a different proof point: Spendflo got 50% manual testing down to cut in first quarter. Might be more relevant to your situation. No pressure, but if this is something you're wrestling with, let's talk.", "touch_6": "Hey Fora, not trying to clog your inbox, so I'll step back. If testing ever becomes a priority, you know where to find me. Good luck out there. Thanks for your time, and good luck with hr talent management platform.", "call_snippet_1": "Hey Fora, this is Rob from Testsigma - I noticed you're heading up QA strategy at ClearCompany.\nAs ClearCompany scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Fora, this is Rob from Testsigma - I noticed you're heading up QA strategy at ClearCompany.\nAs ClearCompany scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "No LinkedIn profile found via web search. ZoomInfo has email contact."}, {"id": 5, "name": "Brian Peters", "title": "Director Quality Eng", "company": "ADT", "vertical": "IoT/Security", "persona": "QA", "key_detail": "Since 2014, manages 25+ test engineers", "company_detail": "Smart home and security IoT platform", "linkedin": "linkedin.com/in/brian-peters-8037a99", "employee_count": 5000, "ab_group": "A - Maintenance angle", "touch_1_subject": "ADT + testing", "touch_1_body": "Saw you took the director role at ADT - that's a solid team to be building.\n\nIoT platforms have to test across hardware variants, firmware versions, and connectivity scenarios - that's exponential complexity.\n\nADT hit similar walls - they got maintenance reduction down to 90%. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat.", "touch_3": "Circling back quick - one thing I should've mentioned: ADT went from maintenance reduction to 90%. Same vertical, similar scale. No pressure, but if this is something you're wrestling with, let's talk. With IoT complexity, that 90% maintenance reduction buying you bandwidth for hardware variant testing could change your roadmap.", "touch_6": "Hey Brian, I'll get out of your hair. If priorities shift down the road and you want to explore, I'm easy to reach. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Brian, this is Rob from Testsigma - you're doing interesting work on the Director Quality Eng side at ADT.\nIoT platforms have to test across hardware variants, firmware versions, and connectivity scenarios - that's exponential complexity.\nWe helped ADT solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Brian, this is Rob from Testsigma - you're doing interesting work on the Director Quality Eng side at ADT.\nSecurity products like ADT's can't afford flaky regression tests - false negatives are a liability.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Title is Director Quality Engineering at ADT, not VP"}, {"id": 6, "name": "Tom Vidal", "title": "Sr Director Quality Eng", "company": "Broadridge", "vertical": "FinTech", "persona": "QA", "key_detail": "Since 2013, previously VP QA at Morgan Stanley", "company_detail": "Financial services technology platform", "linkedin": "linkedin.com/in/tom-vidal-3a95a614", "employee_count": 12000, "ab_group": "A - Maintenance angle", "touch_1_subject": "Broadridge + testing", "touch_1_body": "Been following your work heading up QA at Broadridge - the scale of your team there caught my attention.\n\nAPI-heavy platforms like Broadridge's mean test brittleness when integrations evolve.\n\nCRED faced the same challenge. By automating smarter, they went from 90% regression automation to 5x faster execution. Game-changer for their velocity.\n\nNot sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_3": "One more angle I didn't mention - thought of a different proof point: CRED got 90% regression automation down to 5x faster execution. Might be more relevant to your situation. Thought it might be worth exploring together. If not, no worries.", "touch_6": "Hey Tom, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Tom, this is Rob from Testsigma - your role scaling QA at Broadridge is exactly the kind of challenge we work on.\nAPI-heavy platforms like Broadridge's mean test brittleness when integrations evolve.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Tom, this is Rob from Testsigma - your role scaling QA at Broadridge is exactly the kind of challenge we work on.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at Broadridge's velocity is probably steep.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 7, "name": "Nour E.", "title": "Director QA Eng", "company": "Bamboo Health", "vertical": "Healthcare", "persona": "QA", "key_detail": "Since Feb 2022, also Sr EM QA at Appriss Health", "company_detail": "Healthcare care coordination platform", "linkedin": "", "employee_count": 300, "ab_group": "A - Maintenance angle", "touch_1_subject": "QA at Bamboo Health", "touch_1_body": "Been following your work heading up QA at Bamboo Health - the scale of your team there caught my attention.\n\nCompliance requirements at Bamboo Health mean you can't skip regression cycles, but they're choking your release velocity.\n\nMedibuddy faced the same challenge. By automating smarter, they went from 2,500 tests automated to 50% maintenance cut. Game-changer for their velocity.\n\nCurious if this is on your radar. Happy to chat if it is.", "touch_3": "Wanted to loop back with something - came across another angle: Medibuddy's 2,500 tests automated dropped to 50% maintenance cut. Wondering if that resonates more. Curious if this is on your radar. Happy to chat if it is. For care coordination workflows, automating that piece means your team can focus on the complexities that actually need human touch.", "touch_6": "Hey Nour, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Wishing you and your team the best with since feb 2022, also sr em qa at appriss health.", "call_snippet_1": "Hey Nour, this is Rob from Testsigma - you're doing interesting work on the Director QA Eng side at Bamboo Health.\nCare coordination platforms generate complex test cases that fragment across your team.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Nour, this is Rob from Testsigma - you're doing interesting work on the Director QA Eng side at Bamboo Health.\nCare coordination platforms generate complex test cases that fragment across your team.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "No LinkedIn profile found for Nour E. at Bamboo Health"}, {"id": 8, "name": "Tejas Dhruv", "title": "Head of QA DevOps Automation", "company": "S&P Global", "vertical": "FinTech", "persona": "QA", "key_detail": "Finance tech QA leader, since April 2018", "company_detail": "Financial data and analytics platform", "linkedin": "linkedin.com/in/tejas-dhruv-88888b1", "employee_count": 23000, "ab_group": "A - Maintenance angle", "touch_1_subject": "S&P Global + testing", "touch_1_body": "Your role building QA infrastructure at S&P Global across 23000 employees is impressive.\n\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at S&P Global's velocity is probably steep.\n\nCRED hit similar walls - they got 90% regression automation down to 5x faster execution. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nCurious what you think. If it resonates, let's grab a time to talk through it.", "touch_3": "Wanted to loop back with something - came across another angle: CRED's 90% regression automation dropped to 5x faster execution. Wondering if that resonates more. Let me know if this feels like something worth 15 minutes to discuss. CRED's scale meant every maintenance cycle cost them revenue velocity - sounds similar to what you're managing.", "touch_6": "Hey Tejas, wrapping up my outreach. If scaling QA becomes urgent, reach out. Otherwise, best of luck with your current focus. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Tejas, this is Rob from Testsigma - you're doing interesting work on the Head of QA DevOps Automation side at S&P Global.\nAPI-heavy platforms like S&P Global's mean test brittleness when integrations evolve.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Tejas, this is Rob from Testsigma - you're doing interesting work on the Head of QA DevOps Automation side at S&P Global.\nAPI-heavy platforms like S&P Global's mean test brittleness when integrations evolve.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Title is Head of QA/DevOps/Automation at S&P Global"}, {"id": 9, "name": "Ronak Ray", "title": "VP QA & AI Strategy", "company": "Forbes", "vertical": "Media", "persona": "QA", "key_detail": "Spoke at Testflix 2025 on AI in testing", "company_detail": "Digital media and content platform", "linkedin": "linkedin.com/in/ronakray", "employee_count": 800, "ab_group": "A - Maintenance angle", "touch_1_subject": "Testing velocity at Forbes", "touch_1_body": "Saw you took the director role at Forbes - that's a solid team to be building.\n\nContent platforms like Forbes's probably update features multiple times a day - manual regression testing doesn't scale.\n\nNagra DTV faced the same challenge. By automating smarter, they went from 2,500 tests in 8 months to 4X faster. Game-changer for their velocity.\n\nThought it might be worth exploring together. If not, no worries. Curious how this lands with spoke at testflix 2025 on ai in testing right now.", "touch_3": "Quick follow-up - came across another angle: Nagra DTV's 2,500 tests in 8 months dropped to 4X faster. Wondering if that resonates more. Totally understand if timing isn't right - but if it is, I'd love to chat. Given your platform's transaction volume, reducing manual test work would directly impact your deployment speed.", "touch_6": "Hey Ronak, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Thanks for your time, and good luck with digital media and content platform.", "call_snippet_1": "Hey Ronak, this is Rob from Testsigma - your background leading quality engineering at Forbes caught my attention.\nThe sheer volume of user-facing changes at Forbes means regression testing is a perpetual bottleneck.\nWe helped Nagra DTV solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Ronak, this is Rob from Testsigma - your background leading quality engineering at Forbes caught my attention.\nMedia platforms deal with flaky integration tests across CDNs, analytics, and ad systems - maintenance is brutal.\nWe helped Forbes solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Title is VP Quality Assurance & AI Strategy at Forbes"}, {"id": 10, "name": "Suresh Kumar", "title": "Sr Director QE Delivery Head", "company": "Ascendion", "vertical": "Consulting", "persona": "QA", "key_detail": "Previously Director QA at Oracle (PeopleSoft, Agile)", "company_detail": "Tech consulting services", "linkedin": "", "employee_count": 8000, "ab_group": "A - Maintenance angle", "touch_1_subject": "QA at Ascendion", "touch_1_body": "Saw you took the director role at Ascendion - that's a solid team to be building.\n\nConsulting platforms need testing flexibility across disparate tech stacks - that's hard to scale manually.\n\nFortune 100 faced the same challenge. By automating smarter, they went from 3X productivity to increase. Game-changer for their velocity.\n\nCurious if this is on your radar. Happy to chat if it is. We've seen this especially with teams like yours managing complex testing across tech consulting services.", "touch_3": "Didn't want this to get lost - came across another angle: Fortune 100's 3X productivity dropped to increase. Wondering if that resonates more. Would be happy to dig deeper if it's relevant to what you're working on. That speed boost is especially critical when your team's already stretched across multiple compliance domains.", "touch_6": "Hey Suresh, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Suresh, this is Rob from Testsigma - I noticed you're heading up QA strategy at Ascendion.\nMulti-client delivery at Ascendion means testing complexity that typical tools weren't built for.\nWe helped Fortune 100 solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Suresh, this is Rob from Testsigma - I noticed you're heading up QA strategy at Ascendion.\nConsulting platforms need testing flexibility across disparate tech stacks - that's hard to scale manually.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 5, "overall_score": 8.7, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "Name too common - multiple Suresh Kumar profiles, none confirmed at Ascendion"}, {"id": 13, "name": "Sujatha Valluru", "title": "Director QA Eng", "company": "LendKey", "vertical": "FinTech", "persona": "QA", "key_detail": "17+ years IT, QA and dev", "company_detail": "FinTech lending platform", "linkedin": "linkedin.com/in/sujatha-valluru", "employee_count": 200, "ab_group": "A - Maintenance angle", "touch_1_subject": "Testing at LendKey", "touch_1_body": "Saw you took the director role at LendKey - that's a solid team to be building.\n\nEvery time compliance rules or fraud detection logic changes at LendKey, the regression surface probably expands.\n\nCRED was drowning in test maintenance until they automated their regression cycles. 90% regression automation became 5x faster execution. Huge shift.\n\nCurious what you think. If it resonates, let's grab a time to talk through it. Curious how this lands with 17+ years it, qa and dev right now.", "touch_3": "Quick follow-up - came across another angle: CRED's 90% regression automation dropped to 5x faster execution. Wondering if that resonates more. Thought it might be worth exploring together. If not, no worries. With 40+ test engineers, one efficiency win compounds across your whole team.", "touch_6": "Hey Sujatha, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Wishing you and your team the best with 17+ years it, qa and dev.", "call_snippet_1": "Hey Sujatha, this is Rob from Testsigma - your background leading quality engineering at LendKey caught my attention.\nAPI-heavy platforms like LendKey's mean test brittleness when integrations evolve.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Sujatha, this is Rob from Testsigma - your background leading quality engineering at LendKey caught my attention.\nEvery time compliance rules or fraud detection logic changes at LendKey, the regression surface probably expands.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "flagged", "flag_notes": "LEFT LendKey - marked last day. Needs company update or replacement."}, {"id": 14, "name": "Paul Holland", "title": "Sr Director Test Eng", "company": "Medidata Solutions", "vertical": "Healthcare", "persona": "QA", "key_detail": "4.5+ years, spoke at CAST 2025", "company_detail": "Clinical trials technology platform", "linkedin": "linkedin.com/in/paul-j-holland", "employee_count": 3000, "ab_group": "A - Maintenance angle", "touch_1_subject": "Medidata Solutions QA cycles", "touch_1_body": "Your role building QA infrastructure at Medidata Solutions across 3000 employees is impressive.\n\nCare coordination platforms generate complex test cases that fragment across your team.\n\nMedibuddy hit similar walls - they got 2,500 tests automated down to 50% maintenance cut. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat. We've seen this especially with teams like yours managing complex testing across clinical trials technology platform.", "touch_3": "One more angle I didn't mention - thought of a different proof point: Medibuddy got 2,500 tests automated down to 50% maintenance cut. Might be more relevant to your situation. Would be happy to dig deeper if it's relevant to what you're working on.", "touch_6": "Hey Paul, wrapping up my outreach. If scaling QA becomes urgent, reach out. Otherwise, best of luck with your current focus. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Paul, this is Rob from Testsigma - your background leading quality engineering at Medidata Solutions caught my attention.\nRegulated platforms like Medidata Solutions's need bulletproof coverage, but manual maintenance is eating into your velocity.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Paul, this is Rob from Testsigma - your background leading quality engineering at Medidata Solutions caught my attention.\nCompliance requirements at Medidata Solutions mean you can't skip regression cycles, but they're choking your release velocity.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "flagged", "flag_notes": "LEFT Medidata - now at Testing Thoughts LLC / Hudson's Bay. Needs company update or replacement."}, {"id": 15, "name": "Sudeepta Guchhait", "title": "Sr Director Product Framework & QE", "company": "Nasdaq", "vertical": "FinTech", "persona": "QA", "key_detail": "Discussed Mimic AI testing platform", "company_detail": "Capital markets technology platform", "linkedin": "linkedin.com/in/sudeeptaguchhait", "employee_count": 18000, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quick question re: Nasdaq", "touch_1_body": "Your role building QA infrastructure at Nasdaq across 18000 employees is impressive.\n\nAPI-heavy platforms like Nasdaq's mean test brittleness when integrations evolve.\n\nCRED hit similar walls - they got 90% regression automation down to 5x faster execution. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nCurious if this is on your radar. Happy to chat if it is. That's especially true for capital markets technology platform where every test that breaks costs time.", "touch_3": "Wanted to loop back with something - one thing I should've mentioned: CRED went from 90% regression automation to 5x faster execution. Same vertical, similar scale. Thought it might be worth exploring together. If not, no worries. Building a QA function from scratch at scale - that maintenance reduction would let you focus on the infrastructure pieces that actually scale.", "touch_6": "Hey Sudeepta, wrapping up my outreach. If scaling QA becomes urgent, reach out. Otherwise, best of luck with your current focus. Thanks for your time, and good luck with capital markets technology platform.", "call_snippet_1": "Hey Sudeepta, this is Rob from Testsigma - I noticed you're heading up QA strategy at Nasdaq.\nAPI-heavy platforms like Nasdaq's mean test brittleness when integrations evolve.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Sudeepta, this is Rob from Testsigma - I noticed you're heading up QA strategy at Nasdaq.\nAPI-heavy platforms like Nasdaq's mean test brittleness when integrations evolve.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Senior Director Product Framework & QE at Nasdaq"}, {"id": 16, "name": "Tal Shevach", "title": "VP Devtest & Automation, Head of QA", "company": "DriveNets", "vertical": "Network/Cloud", "persona": "QA", "key_detail": "Previously Sr Director QA at Imperva, Check Point", "company_detail": "Network cloud software platform", "linkedin": "", "employee_count": 400, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quick question re: DriveNets", "touch_1_body": "Saw you took the director role at DriveNets - that's a solid team to be building.\n\nInfrastructure platforms like DriveNets's need regression coverage across cloud providers and environments.\n\nDriveNets was drowning in test maintenance until they automated their regression cycles. API and cloud testing became 4X coverage. Huge shift.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat. Curious how this lands with previously sr director qa at imperva, check point right now.", "touch_3": "Wanted to loop back with something - came across another angle: DriveNets's API and cloud testing dropped to 4X coverage. Wondering if that resonates more. Let me know if this feels like something worth 15 minutes to discuss. The fraud detection updates you're running mean your regression surface keeps expanding - that's exactly where maintenance reduction matters most.", "touch_6": "Hey Tal, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Tal, this is Rob from Testsigma - I noticed you're heading up QA strategy at DriveNets.\nCloud-native platforms change frequently, and your regression tests probably need constant rework.\nWe helped DriveNets solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Tal, this is Rob from Testsigma - I noticed you're heading up QA strategy at DriveNets.\nNetwork testing requires state management that most automation tools weren't designed for - that's your maintenance pain.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "No LinkedIn profile indexed. VP DevTest & Automation at DriveNets. Based in Israel - NOT US."}, {"id": 17, "name": "Henry Darana", "title": "Head of QA", "company": "TRAY", "vertical": "SaaS", "persona": "QA", "key_detail": "Since Feb 2019", "company_detail": "iPaaS and integration automation platform", "linkedin": "", "employee_count": 350, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quick question re: TRAY", "touch_1_body": "Saw you took the director role at TRAY - that's a solid team to be building.\n\nMulti-tenant platforms like TRAY's have to regression test across customer configs - that's a matrix problem.\n\nSpendflo hit similar walls - they got 50% manual testing down to cut in first quarter. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nNot sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_3": "Didn't want this to get lost - came across another angle: Spendflo's 50% manual testing dropped to cut in first quarter. Wondering if that resonates more. Would be happy to dig deeper if it's relevant to what you're working on.", "touch_6": "Hey Henry, I'll get out of your hair. If priorities shift down the road and you want to explore, I'm easy to reach. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Henry, this is Rob from Testsigma - you're doing interesting work on the Head of QA side at TRAY.\nMulti-tenant platforms like TRAY's have to regression test across customer configs - that's a matrix problem.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Henry, this is Rob from Testsigma - you're doing interesting work on the Head of QA side at TRAY.\nMulti-tenant platforms like TRAY's have to regression test across customer configs - that's a matrix problem.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "No LinkedIn profile indexed. Head of QA at TRAY. Based in Hyderabad India - NOT US."}, {"id": 18, "name": "Oren Amit", "title": "Director of QA", "company": "AppCard", "vertical": "SaaS", "persona": "QA", "key_detail": "Since Aug 2019, leads QA team", "company_detail": "Retail data analytics and loyalty SaaS", "linkedin": "linkedin.com/in/oren-amit-b84786307", "employee_count": 150, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quality engineering question", "touch_1_body": "Saw you took the director role at AppCard - that's a solid team to be building.\n\nAs AppCard scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\n\nSpendflo hit similar walls - they got 50% manual testing down to cut in first quarter. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nWould be happy to dig deeper if it's relevant to what you're working on.", "touch_3": "Didn't want this to get lost - thought of a different proof point: Spendflo got 50% manual testing down to cut in first quarter. Might be more relevant to your situation. If this resonates, worth a quick conversation? Digital health platforms move fast, and your team's probably feeling that pressure on test maintenance cycles.", "touch_6": "Hey Oren, I'll get out of your hair. If priorities shift down the road and you want to explore, I'm easy to reach. Wishing you and your team the best with since aug 2019, leads qa team.", "call_snippet_1": "Hey Oren, this is Rob from Testsigma - I noticed you're heading up QA strategy at AppCard.\nMulti-tenant platforms like AppCard's have to regression test across customer configs - that's a matrix problem.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Oren, this is Rob from Testsigma - I noticed you're heading up QA strategy at AppCard.\nMulti-tenant platforms like AppCard's have to regression test across customer configs - that's a matrix problem.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "budget", "objection": "Budget is tight for new tools", "response": "Totally get it. One company your size (Spendflo) cut manual testing 50% and saw ROI in the first quarter. Worth exploring."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 19, "name": "Advait Joshi", "title": "Director Insurance Practice", "company": "Capgemini", "vertical": "Consulting", "persona": "QA", "key_detail": "Previously Head QE at Allvue Systems, Director at FIS, Guidewire expert", "company_detail": "Global consulting services", "linkedin": "linkedin.com/in/advait-joshi-2795868", "employee_count": 350000, "ab_group": "A - Maintenance angle", "touch_1_subject": "Capgemini QA cycles", "touch_1_body": "Your role building QA infrastructure at Capgemini across 350000 employees is impressive.\n\nYour clients at Capgemini expect fast iterations, but regression testing is becoming the limiting factor.\n\nWe helped Fortune 100 solve this exact problem. 3X productivity meant they could cut increase off their regression cycles. Freed up the whole team.\n\nNo pressure, but if this is something you're wrestling with, let's talk. Curious how this lands with previously head qe at allvue systems, director at fis, guidewire expert right now.", "touch_3": "Wanted to loop back with something - came across another angle: Fortune 100's 3X productivity dropped to increase. Wondering if that resonates more. If the timing is right and this feels relevant, would love to talk through it. Real estate scale means test scenarios multiply - that maintenance reduction would be compound savings over time.", "touch_6": "Hey Advait, wrapping up my outreach. If scaling QA becomes urgent, reach out. Otherwise, best of luck with your current focus. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Advait, this is Rob from Testsigma - you're doing interesting work on the Director Insurance Practice side at Capgemini.\nYour clients at Capgemini expect fast iterations, but regression testing is becoming the limiting factor.\nWe helped Fortune 100 solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Advait, this is Rob from Testsigma - you're doing interesting work on the Director Insurance Practice side at Capgemini.\nYour clients at Capgemini expect fast iterations, but regression testing is becoming the limiting factor.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "security_procurement", "objection": "Security/procurement is complex", "response": "We offer on-prem, private cloud, and hybrid. SOC2/ISO certified. Several Fortune 500s run us behind their firewall."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "19+ years QA at Capgemini"}, {"id": 20, "name": "Dhara Dhuldhoya", "title": "Head of Quality Eng", "company": "Frost Bank", "vertical": "FinServ", "persona": "QA", "key_detail": "15+ years SQA, ex-S&P Global, ex-Sabre, ex-Progressive Insurance", "company_detail": "Regional banking and digital banking platform", "linkedin": "linkedin.com/in/dhara-dhuldhoya", "employee_count": 4000, "ab_group": "A - Maintenance angle", "touch_1_subject": "Head question", "touch_1_body": "Saw you took the director role at Frost Bank - that's a solid team to be building.\n\nRegulatory changes mean frequent rule updates, and each one cascades into test maintenance debt at Frost Bank.\n\nHansard faced the same challenge. By automating smarter, they went from regression 8 weeks to 5 weeks. Game-changer for their velocity.\n\nNot sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_3": "Quick follow-up - realized Hansard tackled this from a different angle. regression 8 weeks became 5 weeks. Worth comparing notes? If this resonates, worth a quick conversation? With automotive regulatory requirements, your team's probably tighter on resources than most - that efficiency gain matters.", "touch_6": "Hey Dhara, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Thanks for your time, and good luck with regional banking and digital banking platform.", "call_snippet_1": "Hey Dhara, this is Rob from Testsigma - your role scaling QA at Frost Bank is exactly the kind of challenge we work on.\nBanking platforms like Frost Bank live on regression testing, but the manual cost is probably your biggest bottleneck.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Dhara, this is Rob from Testsigma - your role scaling QA at Frost Bank is exactly the kind of challenge we work on.\nRegulatory changes mean frequent rule updates, and each one cascades into test maintenance debt at Frost Bank.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 21, "name": "Nishi Nigam", "title": "Head of Testing", "company": "Kaiser Permanente", "vertical": "Healthcare", "persona": "QA", "key_detail": "Previously Director Eng at Avaya, QA Manager at Amazon, Director QA at Arbor Networks", "company_detail": "Healthcare services platform", "linkedin": "linkedin.com/in/nishinigam", "employee_count": 230000, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quality engineering question", "touch_1_body": "Been following your work heading up QA at Kaiser Permanente - the scale of your team there caught my attention.\n\nCompliance requirements at Kaiser Permanente mean you can't skip regression cycles, but they're choking your release velocity.\n\nMedibuddy faced the same challenge. By automating smarter, they went from 2,500 tests automated to 50% maintenance cut. Game-changer for their velocity.\n\nNot sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_3": "Didn't want this to get lost - one thing I should've mentioned: Medibuddy went from 2,500 tests automated to 50% maintenance cut. Same vertical, similar scale. Not sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_6": "Hey Nishi, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Nishi, this is Rob from Testsigma - your role scaling QA at Kaiser Permanente is exactly the kind of challenge we work on.\nCare coordination platforms generate complex test cases that fragment across your team.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Nishi, this is Rob from Testsigma - your role scaling QA at Kaiser Permanente is exactly the kind of challenge we work on.\nCompliance requirements at Kaiser Permanente mean you can't skip regression cycles, but they're choking your release velocity.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "security_procurement", "objection": "Security/procurement is complex", "response": "We offer on-prem, private cloud, and hybrid. SOC2/ISO certified. Several Fortune 500s run us behind their firewall."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 22, "name": "Gaurav Nagpal", "title": "Director Quality Eng", "company": "Smart Energy Water", "vertical": "Utilities", "persona": "QA", "key_detail": "CTAL, Scrum certified", "company_detail": "Utility management SaaS platform", "linkedin": "linkedin.com/in/gaurav-nagpal-21375530", "employee_count": 200, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quick question re: Smart Energy Water", "touch_1_body": "Your role building QA infrastructure at Smart Energy Water across 200 employees is impressive.\n\nUtility software has to work across legacy and modern infrastructure - that's a test surface that's hard to scale.\n\nSpendflo was drowning in test maintenance until they automated their regression cycles. 50% manual testing became cut. Huge shift.\n\nIf the timing is right and this feels relevant, would love to talk through it. Curious how this lands with ctal, scrum certified right now.", "touch_3": "Wanted to loop back with something - came across another angle: Spendflo's 50% manual testing dropped to cut. Wondering if that resonates more. Let me know if this feels like something worth 15 minutes to discuss. Supply chain visibility requires constant testing - that freed-up bandwidth would let you test deeper.", "touch_6": "Hey Gaurav, I'll close the loop here. Totally get if the timing isn't right. Just wanted to make sure you had the option. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Gaurav, this is Rob from Testsigma - I noticed you're heading up QA strategy at Smart Energy Water.\nUtility software has to work across legacy and modern infrastructure - that's a test surface that's hard to scale.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Gaurav, this is Rob from Testsigma - I noticed you're heading up QA strategy at Smart Energy Water.\nUtility software has to work across legacy and modern infrastructure - that's a test surface that's hard to scale.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "budget", "objection": "Budget is tight for new tools", "response": "Totally get it. One company your size (Spendflo) cut manual testing 50% and saw ROI in the first quarter. Worth exploring."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Director Quality Engineering at Smart Energy Water"}, {"id": 23, "name": "Nikita Barkovsky", "title": "QA Director/Head of QA", "company": "Various Software", "vertical": "SaaS", "persona": "QA", "key_detail": "Selenium, TestComplete, HP QTP experience", "company_detail": "Software QA leadership", "linkedin": "linkedin.com/in/barkovskynikita", "employee_count": 100, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quick question re: Various Software", "touch_1_body": "Saw you took the director role at Various Software - that's a solid team to be building.\n\nAs Various Software scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\n\nSpendflo faced the same challenge. By automating smarter, they went from 50% manual testing to cut in first quarter. Game-changer for their velocity.\n\nNot sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_3": "Quick follow-up - one thing I should've mentioned: Spendflo went from 50% manual testing to cut in first quarter. Same vertical, similar scale. If this resonates, worth a quick conversation? Your scale across payment methods means test maintenance is probably a constant drain - that reduction would compound.", "touch_6": "Hey Nikita, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Wishing you and your team the best with selenium, testcomplete, hp qtp experience.", "call_snippet_1": "Hey Nikita, this is Rob from Testsigma - your role scaling QA at Various Software is exactly the kind of challenge we work on.\nYour platform probably ships multiple times a week, which means regression cycles either slow you down or get skipped.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Nikita, this is Rob from Testsigma - your role scaling QA at Various Software is exactly the kind of challenge we work on.\nAs Various Software scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "budget", "objection": "Budget is tight for new tools", "response": "Totally get it. One company your size (Spendflo) cut manual testing 50% and saw ROI in the first quarter. Worth exploring."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 24, "name": "Zain Naqvi", "title": "QA Engineering Manager", "company": "Ex-Roblox", "vertical": "Gaming", "persona": "QA", "key_detail": "Mobile/web testing, Sony project", "company_detail": "Gaming and entertainment platform", "linkedin": "linkedin.com/in/zain-naqvi-240a3023", "employee_count": 2000, "ab_group": "A - Maintenance angle", "touch_1_subject": "Testing at Ex-Roblox", "touch_1_body": "Saw you took the director role at Ex-Roblox - that's a solid team to be building.\n\nYour release cycles at Ex-Roblox probably need fast feedback, but regression testing is the friction point.\n\nNagra DTV was drowning in test maintenance until they automated their regression cycles. 2,500 tests in 8 months became 4X faster. Huge shift.\n\nNot sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_3": "Quick follow-up - realized Nagra DTV tackled this from a different angle. 2,500 tests in 8 months became 4X faster. Worth comparing notes? Let me know if this feels like something worth 15 minutes to discuss. ERP systems require deep regression coverage - freeing up your team from maintenance drag matters.", "touch_6": "Hey Zain, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Zain, this is Rob from Testsigma - your background leading quality engineering at Ex-Roblox caught my attention.\nYour release cycles at Ex-Roblox probably need fast feedback, but regression testing is the friction point.\nWe helped Nagra DTV solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Zain, this is Rob from Testsigma - your background leading quality engineering at Ex-Roblox caught my attention.\nCross-platform testing (web, mobile, console) at Ex-Roblox multiplies your regression surface.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 25, "name": "Mona Saxena", "title": "Software QA Engineering Manager", "company": "Tech Company", "vertical": "SaaS", "persona": "QA", "key_detail": "QA Engineering leadership", "company_detail": "Software QA management", "linkedin": "linkedin.com/in/monasaxena", "employee_count": 500, "ab_group": "A - Maintenance angle", "touch_1_subject": "Software question", "touch_1_body": "Been following your work heading up QA at Tech Company - the scale of your team there caught my attention.\n\nAs Tech Company scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\n\nSpendflo was drowning in test maintenance until they automated their regression cycles. 50% manual testing became cut in first quarter. Huge shift.\n\nThought it might be worth exploring together. If not, no worries.", "touch_3": "Didn't want this to get lost - thought of a different proof point: Spendflo got 50% manual testing down to cut in first quarter. Might be more relevant to your situation. Curious if this is on your radar. Happy to chat if it is.", "touch_6": "Hey Mona, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Thanks for your time, and good luck with software qa management.", "call_snippet_1": "Hey Mona, this is Rob from Testsigma - your role scaling QA at Tech Company is exactly the kind of challenge we work on.\nAs Tech Company scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Mona, this is Rob from Testsigma - your role scaling QA at Tech Company is exactly the kind of challenge we work on.\nYour platform probably ships multiple times a week, which means regression cycles either slow you down or get skipped.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 26, "name": "Anand Chawda", "title": "Director Head of QE", "company": "RBC Capital Markets", "vertical": "FinTech", "persona": "QA", "key_detail": "Shift-left strategies, legacy migration", "company_detail": "Banking and capital markets technology", "linkedin": "linkedin.com/in/anandchawda", "employee_count": 15000, "ab_group": "B - Velocity angle", "touch_1_subject": "Quality engineering question", "touch_1_body": "Been following your work heading up QA at RBC Capital Markets - the scale of your team there caught my attention.\n\nEvery time compliance rules or fraud detection logic changes at RBC Capital Markets, the regression surface probably expands.\n\nCRED was drowning in test maintenance until they automated their regression cycles. 90% regression automation became 5x faster execution. Huge shift.\n\nCurious what you think. If it resonates, let's grab a time to talk through it.", "touch_3": "Circling back quick - came across another angle: CRED's 90% regression automation dropped to 5x faster execution. Wondering if that resonates more. Thought it might be worth exploring together. If not, no worries. For platforms serving enterprise customers, test reliability is non-negotiable - that efficiency translates to faster releases.", "touch_6": "Hey Anand, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Anand, this is Rob from Testsigma - you're doing interesting work on the Director Head of QE side at RBC Capital Markets.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at RBC Capital Markets's velocity is probably steep.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Anand, this is Rob from Testsigma - you're doing interesting work on the Director Head of QE side at RBC Capital Markets.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at RBC Capital Markets's velocity is probably steep.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Based in Canada. Title is Director Strategic Programs at RBC."}, {"id": 27, "name": "Snehal", "title": "Director Quality Eng", "company": "Slalom", "vertical": "Consulting", "persona": "QA", "key_detail": "20+ years, cloud/AI/GenAI, spoke at Innovate QA 2025", "company_detail": "Consulting services", "linkedin": "linkedin.com/in/snehal-l-5a2a487", "employee_count": 8000, "ab_group": "B - Velocity angle", "touch_1_subject": "QA at Slalom", "touch_1_body": "Saw you took the director role at Slalom - that's a solid team to be building.\n\nConsulting platforms need testing flexibility across disparate tech stacks - that's hard to scale manually.\n\nFortune 100 was drowning in test maintenance until they automated their regression cycles. 3X productivity became increase. Huge shift.\n\nNo pressure, but if this is something you're wrestling with, let's talk. That's especially true for consulting services where every test that breaks costs time.", "touch_3": "One more angle I didn't mention - thought of a different proof point: Fortune 100 got 3X productivity down to increase. Might be more relevant to your situation. If the timing is right and this feels relevant, would love to talk through it.", "touch_6": "Hey Snehal, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Snehal, this is Rob from Testsigma - your background leading quality engineering at Slalom caught my attention.\nYour clients at Slalom expect fast iterations, but regression testing is becoming the limiting factor.\nWe helped Fortune 100 solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Snehal, this is Rob from Testsigma - your background leading quality engineering at Slalom caught my attention.\nYour clients at Slalom expect fast iterations, but regression testing is becoming the limiting factor.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Director of Quality Engineering at Slalom Build. Based in Vancouver Canada - NOT US."}, {"id": 28, "name": "Ruslan M.", "title": "Head of QA CoE", "company": "FinTech/Banking", "vertical": "FinTech", "persona": "QA", "key_detail": "10+ years, Cypress/Selenium expert", "company_detail": "FinTech and banking technology", "linkedin": "linkedin.com/in/ruslan-m", "employee_count": 1000, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing at FinTech/Banking", "touch_1_body": "Saw you took the director role at FinTech/Banking - that's a solid team to be building.\n\nAPI-heavy platforms like FinTech/Banking's mean test brittleness when integrations evolve.\n\nCRED faced the same challenge. By automating smarter, they went from 90% regression automation to 5x faster execution. Game-changer for their velocity.\n\nWould be happy to dig deeper if it's relevant to what you're working on. Curious how this lands with 10+ years, cypress/selenium expert right now.", "touch_3": "Wanted to loop back with something - came across another angle: CRED's 90% regression automation dropped to 5x faster execution. Wondering if that resonates more. Not sure if it's a fit, but figured it was worth flagging. Let me know if you want to explore.", "touch_6": "Hey Ruslan, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Wishing you and your team the best with 10+ years, cypress/selenium expert.", "call_snippet_1": "Hey Ruslan, this is Rob from Testsigma - your background leading quality engineering at FinTech/Banking caught my attention.\nEvery time compliance rules or fraud detection logic changes at FinTech/Banking, the regression surface probably expands.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Ruslan, this is Rob from Testsigma - your background leading quality engineering at FinTech/Banking caught my attention.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at FinTech/Banking's velocity is probably steep.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 29, "name": "Scott Hinkle", "title": "QA Manager", "company": "Estes Express Lines", "vertical": "Logistics", "persona": "QA", "key_detail": "Previously Director QA mumms Software, Director Testing Alfa Insurance", "company_detail": "Logistics and shipping technology", "linkedin": "linkedin.com/in/scott-hinkle-00b6ab4", "employee_count": 3000, "ab_group": "B - Velocity angle", "touch_1_subject": "QA at Estes Express Lines", "touch_1_body": "Your role building QA infrastructure at Estes Express Lines across 3000 employees is impressive.\n\nReal-time tracking and routing at Estes Express Lines means test surface area that changes constantly as integrations expand.\n\nNagra DTV was drowning in test maintenance until they automated their regression cycles. 2,500 tests in 8 months became 4X faster. Huge shift.\n\nIf the timing is right and this feels relevant, would love to talk through it.", "touch_3": "One more angle I didn't mention - realized Nagra DTV tackled this from a different angle. 2,500 tests in 8 months became 4X faster. Worth comparing notes? Thought it might be worth exploring together. If not, no worries. SaaS platforms evolving that fast mean test maintenance is the tax on velocity - that's where the pain usually lives.", "touch_6": "Hey Scott, I'll close the loop here. Totally get if the timing isn't right. Just wanted to make sure you had the option. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Scott, this is Rob from Testsigma - I noticed you're heading up QA strategy at Estes Express Lines.\nReal-time tracking and routing at Estes Express Lines means test surface area that changes constantly as integrations expand.\nWe helped Nagra DTV solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Scott, this is Rob from Testsigma - I noticed you're heading up QA strategy at Estes Express Lines.\nReal-time tracking and routing at Estes Express Lines means test surface area that changes constantly as integrations expand.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "QA Manager at Estes Express Lines, 20 years experience"}, {"id": 30, "name": "Muhammad Ishfaq Zia", "title": "VP Quality Assurance", "company": "Visionet Systems", "vertical": "Consulting", "persona": "VP-QA", "key_detail": "Since July 2025, ex-Kualitatem Associate Director", "company_detail": "IT services and consulting", "linkedin": "linkedin.com/in/muhammad-ishfaq-zia-7a25359", "employee_count": 2000, "ab_group": "B - Velocity angle", "touch_1_subject": "Quick question re: Visionet Systems", "touch_1_body": "Your role building QA infrastructure at Visionet Systems across 2000 employees is impressive.\n\nConsulting platforms need testing flexibility across disparate tech stacks - that's hard to scale manually.\n\nWe helped Fortune 100 solve this exact problem. 3X productivity meant they could cut increase off their regression cycles. Freed up the whole team.\n\nIf this resonates, worth a quick conversation?. That's especially true for it services and consulting where every test that breaks costs time.", "touch_3": "Wanted to loop back with something - one thing I should've mentioned: Fortune 100 went from 3X productivity to increase. Same vertical, similar scale. No pressure, but if this is something you're wrestling with, let's talk. Workflow automation platforms like yours mean test scenarios expand with each feature - maintenance becomes the blocker.", "touch_6": "Hey Muhammad, wrapping up my outreach. If scaling QA becomes urgent, reach out. Otherwise, best of luck with your current focus. Thanks for your time, and good luck with it services and consulting.", "call_snippet_1": "Hey Muhammad, this is Rob from Testsigma - you're doing interesting work on the VP Quality Assurance side at Visionet Systems.\nYour clients at Visionet Systems expect fast iterations, but regression testing is becoming the limiting factor.\nWe helped Fortune 100 solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Muhammad, this is Rob from Testsigma - you're doing interesting work on the VP Quality Assurance side at Visionet Systems.\nMulti-client delivery at Visionet Systems means testing complexity that typical tools weren't built for.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "flagged", "flag_notes": "LEFT Visionet - now Head of Service Delivery & PMO at Kualitatem Inc."}, {"id": 31, "name": "Eugene C.", "title": "VP Engineering", "company": "OKX", "vertical": "FinTech", "persona": "VP-Eng", "key_detail": "NYU Tandon", "company_detail": "Crypto FinTech payments platform", "linkedin": "linkedin.com/in/eugene-c-081ba233", "employee_count": 3000, "ab_group": "B - Velocity angle", "touch_1_subject": "OKX QA cycles", "touch_1_body": "Been following your work heading up QA at OKX - the scale of your team there caught my attention.\n\nAPI-heavy platforms like OKX's mean test brittleness when integrations evolve.\n\nCRED was drowning in test maintenance until they automated their regression cycles. 90% regression automation became 5x faster execution. Huge shift.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat. Curious how this lands with nyu tandon right now.", "touch_3": "Quick follow-up - realized CRED tackled this from a different angle. 90% regression automation became 5x faster execution. Worth comparing notes? Curious if this is on your radar. Happy to chat if it is. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Eugene, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Eugene, this is Rob from Testsigma - you're doing interesting work on the VP Engineering side at OKX.\nAPI-heavy platforms like OKX's mean test brittleness when integrations evolve.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Eugene, this is Rob from Testsigma - you're doing interesting work on the VP Engineering side at OKX.\nAPI-heavy platforms like OKX's mean test brittleness when integrations evolve.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 32, "name": "Sunil Prasad", "title": "VP Engineering", "company": "Cloud FinTech/SaaS", "vertical": "FinTech", "persona": "VP-Eng", "key_detail": "12+ years, AI/ML, India's first UPI merchant product", "company_detail": "FinTech payments platform", "linkedin": "linkedin.com/in/sunil-prasad-tech", "employee_count": 500, "ab_group": "B - Velocity angle", "touch_1_subject": "QA at Cloud FinTech/SaaS", "touch_1_body": "Been following your work heading up QA at Cloud FinTech/SaaS - the scale of your team there caught my attention.\n\nAPI-heavy platforms like Cloud FinTech/SaaS's mean test brittleness when integrations evolve.\n\nCRED hit similar walls - they got 90% regression automation down to 5x faster execution. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nIf this resonates, worth a quick conversation?. We've seen this especially with teams like yours managing complex testing across fintech payments platform.", "touch_3": "One more angle I didn't mention - thought of a different proof point: CRED got 90% regression automation down to 5x faster execution. Might be more relevant to your situation. Curious what you think. If it resonates, let's grab a time to talk through it.", "touch_6": "Hey Sunil, not trying to clog your inbox, so I'll step back. If testing ever becomes a priority, you know where to find me. Good luck out there. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Sunil, this is Rob from Testsigma - your role scaling QA at Cloud FinTech/SaaS is exactly the kind of challenge we work on.\nEvery time compliance rules or fraud detection logic changes at Cloud FinTech/SaaS, the regression surface probably expands.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Sunil, this is Rob from Testsigma - your role scaling QA at Cloud FinTech/SaaS is exactly the kind of challenge we work on.\nAPI-heavy platforms like Cloud FinTech/SaaS's mean test brittleness when integrations evolve.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 33, "name": "Paul Berg", "title": "VP/Principal Engineer", "company": "U.S. Bank", "vertical": "FinServ", "persona": "VP-Eng", "key_detail": "Large-scale systems, cloud tech", "company_detail": "Major banking platform", "linkedin": "linkedin.com/in/paulwberg", "employee_count": 70000, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing at U.S. Bank", "touch_1_body": "Been following your work heading up QA at U.S. Bank - the scale of your team there caught my attention.\n\nBanking platforms like U.S. Bank live on regression testing, but the manual cost is probably your biggest bottleneck.\n\nHansard faced the same challenge. By automating smarter, they went from regression 8 weeks to 5 weeks. Game-changer for their velocity.\n\nWould be happy to dig deeper if it's relevant to what you're working on.", "touch_3": "Didn't want this to get lost - one thing I should've mentioned: Hansard went from regression 8 weeks to 5 weeks. Same vertical, similar scale. No pressure, but if this is something you're wrestling with, let's talk. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Paul, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Wishing you and your team the best with large-scale systems, cloud tech.", "call_snippet_1": "Hey Paul, this is Rob from Testsigma - I noticed you're heading up QA strategy at U.S. Bank.\nBanking platforms like U.S. Bank live on regression testing, but the manual cost is probably your biggest bottleneck.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Paul, this is Rob from Testsigma - I noticed you're heading up QA strategy at U.S. Bank.\nThe friction between speed and safety is probably hitting hard at U.S. Bank - every release needs airtight coverage.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "security_procurement", "objection": "Security/procurement is complex", "response": "We offer on-prem, private cloud, and hybrid. SOC2/ISO certified. Several Fortune 500s run us behind their firewall."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 34, "name": "Richard Ford", "title": "VP Engineering", "company": "CyberCube", "vertical": "FinTech", "persona": "VP-Eng", "key_detail": "Cyber insurance analytics", "company_detail": "Insurance analytics platform", "linkedin": "linkedin.com/in/dr-ford", "employee_count": 300, "ab_group": "B - Velocity angle", "touch_1_subject": "Quality engineering question", "touch_1_body": "Saw you took the director role at CyberCube - that's a solid team to be building.\n\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at CyberCube's velocity is probably steep.\n\nWe helped CRED solve this exact problem. 90% regression automation meant they could cut 5x faster execution off their regression cycles. Freed up the whole team.\n\nIf this resonates, worth a quick conversation?. Curious how this lands with cyber insurance analytics right now.", "touch_3": "Didn't want this to get lost - one thing I should've mentioned: CRED went from 90% regression automation to 5x faster execution. Same vertical, similar scale. Thought it might be worth exploring together. If not, no worries. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Richard, I'll get out of your hair. If priorities shift down the road and you want to explore, I'm easy to reach. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Richard, this is Rob from Testsigma - I noticed you're heading up QA strategy at CyberCube.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at CyberCube's velocity is probably steep.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Richard, this is Rob from Testsigma - I noticed you're heading up QA strategy at CyberCube.\nAPI-heavy platforms like CyberCube's mean test brittleness when integrations evolve.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 35, "name": "Sharath Pasupunuti", "title": "VP Engineering Care Delivery", "company": "Hinge Health", "vertical": "Healthcare", "persona": "VP-Eng", "key_detail": "Digital health and MSK, since July 2022", "company_detail": "Digital health and musculoskeletal care platform", "linkedin": "linkedin.com/in/sharath-pasupunuti-5578b82", "employee_count": 800, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing at Hinge Health", "touch_1_body": "Saw you took the director role at Hinge Health - that's a solid team to be building.\n\nCompliance requirements at Hinge Health mean you can't skip regression cycles, but they're choking your release velocity.\n\nMedibuddy faced the same challenge. By automating smarter, they went from 2,500 tests automated to 50% maintenance cut. Game-changer for their velocity.\n\nNo pressure, but if this is something you're wrestling with, let's talk. We've seen this especially with teams like yours managing complex testing across digital health and musculoskeletal care platform.", "touch_3": "Didn't want this to get lost - thought of a different proof point: Medibuddy got 2,500 tests automated down to 50% maintenance cut. Might be more relevant to your situation. No pressure, but if this is something you're wrestling with, let's talk.", "touch_6": "Hey Sharath, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Thanks for your time, and good luck with digital health and musculoskeletal care platform.", "call_snippet_1": "Hey Sharath, this is Rob from Testsigma - you're doing interesting work on the VP Engineering Care Delivery side at Hinge Health.\nRegulated platforms like Hinge Health's need bulletproof coverage, but manual maintenance is eating into your velocity.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Sharath, this is Rob from Testsigma - you're doing interesting work on the VP Engineering Care Delivery side at Hinge Health.\nRegulated platforms like Hinge Health's need bulletproof coverage, but manual maintenance is eating into your velocity.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "flagged", "flag_notes": "LEFT Hinge Health - now CTO at Sidecar Health. Needs company update."}, {"id": 36, "name": "Vishal Karnik", "title": "VP Engineering", "company": "Vibrent Health", "vertical": "Healthcare", "persona": "VP-Eng", "key_detail": "19+ years, since April 2019", "company_detail": "Precision health platform", "linkedin": "linkedin.com/in/vishal-karnik-97715a1a", "employee_count": 400, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing velocity at Vibrent Health", "touch_1_body": "Your role building QA infrastructure at Vibrent Health across 400 employees is impressive.\n\nRegulated platforms like Vibrent Health's need bulletproof coverage, but manual maintenance is eating into your velocity.\n\nMedibuddy hit similar walls - they got 2,500 tests automated down to 50% maintenance cut. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nNo pressure, but if this is something you're wrestling with, let's talk. That's especially true for precision health platform where every test that breaks costs time.", "touch_3": "Wanted to loop back with something - one thing I should've mentioned: Medibuddy went from 2,500 tests automated to 50% maintenance cut. Same vertical, similar scale. Thought it might be worth exploring together. If not, no worries. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Vishal, wrapping up my outreach. If scaling QA becomes urgent, reach out. Otherwise, best of luck with your current focus. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Vishal, this is Rob from Testsigma - I noticed you're heading up QA strategy at Vibrent Health.\nCompliance requirements at Vibrent Health mean you can't skip regression cycles, but they're choking your release velocity.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Vishal, this is Rob from Testsigma - I noticed you're heading up QA strategy at Vibrent Health.\nRegulated platforms like Vibrent Health's need bulletproof coverage, but manual maintenance is eating into your velocity.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "VP of Engineering at Vibrent Health"}, {"id": 37, "name": "Christopher Cole", "title": "Director Eng Fintech", "company": "ServiceTitan", "vertical": "SaaS", "persona": "Director-Eng", "key_detail": "Previously Head Cloud Security at Coinbase, 10K+ customers", "company_detail": "SaaS for contractors and field services", "linkedin": "", "employee_count": 2000, "ab_group": "B - Velocity angle", "touch_1_subject": "Quick question re: ServiceTitan", "touch_1_body": "Saw you took the director role at ServiceTitan - that's a solid team to be building.\n\nYour platform probably ships multiple times a week, which means regression cycles either slow you down or get skipped.\n\nSpendflo hit similar walls - they got 50% manual testing down to cut in first quarter. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nIf this resonates, worth a quick conversation?", "touch_3": "Wanted to loop back with something - thought of a different proof point: Spendflo got 50% manual testing down to cut in first quarter. Might be more relevant to your situation. If the timing is right and this feels relevant, would love to talk through it.", "touch_6": "Hey Christopher, I'll get out of your hair. If priorities shift down the road and you want to explore, I'm easy to reach. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Christopher, this is Rob from Testsigma - your role scaling QA at ServiceTitan is exactly the kind of challenge we work on.\nMulti-tenant platforms like ServiceTitan's have to regression test across customer configs - that's a matrix problem.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Christopher, this is Rob from Testsigma - your role scaling QA at ServiceTitan is exactly the kind of challenge we work on.\nYour platform probably ships multiple times a week, which means regression cycles either slow you down or get skipped.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Fair point. Most teams we work with had Selenium, Cypress, or similar. The gap they kept hitting was maintenance burden - our self-healing closes that gap differently."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "Name too common - no matching Christopher Cole at ServiceTitan found"}, {"id": 38, "name": "Paul C", "title": "Sr Director Engineering", "company": "LendingClub", "vertical": "FinTech", "persona": "Director-Eng", "key_detail": "Previously VP Eng at Riivos, Switchfly", "company_detail": "FinTech lending marketplace", "linkedin": "linkedin.com/in/paul-chen-sf", "employee_count": 1000, "ab_group": "B - Velocity angle", "touch_1_subject": "LendingClub QA cycles", "touch_1_body": "Been following your work heading up QA at LendingClub - the scale of your team there caught my attention.\n\nEvery time compliance rules or fraud detection logic changes at LendingClub, the regression surface probably expands.\n\nCRED was drowning in test maintenance until they automated their regression cycles. 90% regression automation became 5x faster execution. Huge shift.\n\nCurious if this is on your radar. Happy to chat if it is. We've seen this especially with teams like yours managing complex testing across fintech lending marketplace.", "touch_3": "Circling back quick - thought of a different proof point: CRED got 90% regression automation down to 5x faster execution. Might be more relevant to your situation. Let me know if this feels like something worth 15 minutes to discuss.", "touch_6": "Hey Paul, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Wishing you and your team the best with previously vp eng at riivos, switchfly.", "call_snippet_1": "Hey Paul, this is Rob from Testsigma - you're doing interesting work on the Sr Director Engineering side at LendingClub.\nEvery time compliance rules or fraud detection logic changes at LendingClub, the regression surface probably expands.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Paul, this is Rob from Testsigma - you're doing interesting work on the Sr Director Engineering side at LendingClub.\nAPI-heavy platforms like LendingClub's mean test brittleness when integrations evolve.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Sr Director Engineering at LendingClub. Name is Paul Chen."}, {"id": 39, "name": "Kate Zhang", "title": "Director Eng, Head of Money", "company": "DoorDash", "vertical": "SaaS", "persona": "Director-Eng", "key_detail": "Food delivery and retail payments", "company_detail": "Food delivery and retail platform", "linkedin": "", "employee_count": 10000, "ab_group": "B - Velocity angle", "touch_1_subject": "Quality engineering question", "touch_1_body": "Been following your work heading up QA at DoorDash - the scale of your team there caught my attention.\n\nAs DoorDash scales features, the gap between test coverage ambitions and what your team can maintain keeps widening.\n\nSpendflo hit similar walls - they got 50% manual testing down to cut in first quarter. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat.", "touch_3": "One more angle I didn't mention - thought of a different proof point: Spendflo got 50% manual testing down to cut in first quarter. Might be more relevant to your situation. Thought it might be worth exploring together. If not, no worries.", "touch_6": "Hey Kate, not trying to clog your inbox, so I'll step back. If testing ever becomes a priority, you know where to find me. Good luck out there. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Kate, this is Rob from Testsigma - I noticed you're heading up QA strategy at DoorDash.\nYour platform probably ships multiple times a week, which means regression cycles either slow you down or get skipped.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Kate, this is Rob from Testsigma - I noticed you're heading up QA strategy at DoorDash.\nMulti-tenant platforms like DoorDash's have to regression test across customer configs - that's a matrix problem.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Fair point. Most teams we work with had Selenium, Cypress, or similar. The gap they kept hitting was maintenance burden - our self-healing closes that gap differently."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "No LinkedIn profile found for Kate Zhang at DoorDash"}, {"id": 40, "name": "Eddie Deyo", "title": "Corporate VP Engineering Retail", "company": "NCR Voyix", "vertical": "Retail", "persona": "VP-Eng", "key_detail": "Since 2024, previously CTO at GK Software USA", "company_detail": "Retail POS technology platform", "linkedin": "linkedin.com/in/eddie-deyo-1711016", "employee_count": 8000, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing velocity at NCR Voyix", "touch_1_body": "Your role building QA infrastructure at NCR Voyix across 8000 employees is impressive.\n\nRetail platforms integrate with payment processors, warehouses, and third parties - each integration adds test fragility.\n\nSpendflo was drowning in test maintenance until they automated their regression cycles. 50% manual testing became cut. Huge shift.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat. Curious how this lands with since 2024, previously cto at gk software usa right now.", "touch_3": "Quick follow-up - came across another angle: Spendflo's 50% manual testing dropped to cut. Wondering if that resonates more. If the timing is right and this feels relevant, would love to talk through it. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Eddie, I'll close the loop here. Totally get if the timing isn't right. Just wanted to make sure you had the option. Thanks for your time, and good luck with retail pos technology platform.", "call_snippet_1": "Hey Eddie, this is Rob from Testsigma - your background leading quality engineering at NCR Voyix caught my attention.\nPoint-of-sale and inventory systems like NCR Voyix's need rock-solid regression coverage - downtime is revenue loss.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Eddie, this is Rob from Testsigma - your background leading quality engineering at NCR Voyix caught my attention.\nRetail platforms integrate with payment processors, warehouses, and third parties - each integration adds test fragility.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 41, "name": "Kenny Vu", "title": "VP Engineering Engage", "company": "Appriss Retail", "vertical": "Retail", "persona": "VP-Eng", "key_detail": "20+ years at company, started as engineer", "company_detail": "Retail analytics and loss prevention platform", "linkedin": "linkedin.com/in/kennyvu", "employee_count": 1500, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing velocity at Appriss Retail", "touch_1_body": "Your role building QA infrastructure at Appriss Retail across 1500 employees is impressive.\n\nRetail platforms integrate with payment processors, warehouses, and third parties - each integration adds test fragility.\n\nSpendflo was drowning in test maintenance until they automated their regression cycles. 50% manual testing became cut. Huge shift.\n\nNo pressure, but if this is something you're wrestling with, let's talk. We've seen this especially with teams like yours managing complex testing across retail analytics and loss prevention platform.", "touch_3": "Wanted to loop back with something - realized Spendflo tackled this from a different angle. 50% manual testing became cut. Worth comparing notes? Thought it might be worth exploring together. If not, no worries. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Kenny, I'll close the loop here. Totally get if the timing isn't right. Just wanted to make sure you had the option. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Kenny, this is Rob from Testsigma - your role scaling QA at Appriss Retail is exactly the kind of challenge we work on.\nPoint-of-sale and inventory systems like Appriss Retail's need rock-solid regression coverage - downtime is revenue loss.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Kenny, this is Rob from Testsigma - your role scaling QA at Appriss Retail is exactly the kind of challenge we work on.\nThe frequency of promotional changes and seasonal updates at Appriss Retail means constant regression test rework.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "22 years at Appriss Retail"}, {"id": 42, "name": "Michael Rizzo", "title": "VP Engineering", "company": "Imprivata", "vertical": "Healthcare", "persona": "VP-Eng", "key_detail": "Since Jan 2018, ex-naviHealth, ex-Boston Children's Hospital", "company_detail": "Healthcare identity and IAM platform", "linkedin": "linkedin.com/in/mjrizzo", "employee_count": 600, "ab_group": "B - Velocity angle", "touch_1_subject": "Imprivata QA cycles", "touch_1_body": "Saw you took the director role at Imprivata - that's a solid team to be building.\n\nCompliance requirements at Imprivata mean you can't skip regression cycles, but they're choking your release velocity.\n\nMedibuddy faced the same challenge. By automating smarter, they went from 2,500 tests automated to 50% maintenance cut. Game-changer for their velocity.\n\nThought it might be worth exploring together. If not, no worries. That's especially true for healthcare identity and iam platform where every test that breaks costs time.", "touch_3": "One more angle I didn't mention - came across another angle: Medibuddy's 2,500 tests automated dropped to 50% maintenance cut. Wondering if that resonates more. Curious if this is on your radar. Happy to chat if it is. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Michael, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Michael, this is Rob from Testsigma - I noticed you're heading up QA strategy at Imprivata.\nCompliance requirements at Imprivata mean you can't skip regression cycles, but they're choking your release velocity.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Michael, this is Rob from Testsigma - I noticed you're heading up QA strategy at Imprivata.\nCare coordination platforms generate complex test cases that fragment across your team.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 43, "name": "Jennifer Chan", "title": "VP Engineering", "company": "Smile Digital Health", "vertical": "Healthcare", "persona": "VP-Eng", "key_detail": "Since Jan 2019, FHIR and health data interoperability", "company_detail": "Health data interoperability platform", "linkedin": "", "employee_count": 250, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing velocity at Smile Digital Health", "touch_1_body": "Been following your work heading up QA at Smile Digital Health - the scale of your team there caught my attention.\n\nRegulated platforms like Smile Digital Health's need bulletproof coverage, but manual maintenance is eating into your velocity.\n\nMedibuddy was drowning in test maintenance until they automated their regression cycles. 2,500 tests automated became 50% maintenance cut. Huge shift.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat.", "touch_3": "Quick follow-up - thought of a different proof point: Medibuddy got 2,500 tests automated down to 50% maintenance cut. Might be more relevant to your situation. Totally understand if timing isn't right - but if it is, I'd love to chat.", "touch_6": "Hey Jennifer, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Wishing you and your team the best with since jan 2019, fhir and health data interoperability.", "call_snippet_1": "Hey Jennifer, this is Rob from Testsigma - you're doing interesting work on the VP Engineering side at Smile Digital Health.\nCompliance requirements at Smile Digital Health mean you can't skip regression cycles, but they're choking your release velocity.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Jennifer, this is Rob from Testsigma - you're doing interesting work on the VP Engineering side at Smile Digital Health.\nCare coordination platforms generate complex test cases that fragment across your team.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "No LinkedIn profile found for Jennifer Chan at Smile Digital Health"}, {"id": 44, "name": "Troy Schuetrumpf", "title": "VP Engineering Platform", "company": "Elation Health", "vertical": "Healthcare", "persona": "VP-Eng", "key_detail": "Primary care EHR platform", "company_detail": "Primary care EHR platform", "linkedin": "linkedin.com/in/tschuetrumpf", "employee_count": 600, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing velocity at Elation Health", "touch_1_body": "Your role building QA infrastructure at Elation Health across 600 employees is impressive.\n\nCompliance requirements at Elation Health mean you can't skip regression cycles, but they're choking your release velocity.\n\nMedibuddy was drowning in test maintenance until they automated their regression cycles. 2,500 tests automated became 50% maintenance cut. Huge shift.\n\nCurious what you think. If it resonates, let's grab a time to talk through it. We've seen this especially with teams like yours managing complex testing across primary care ehr platform.", "touch_3": "Wanted to loop back with something - thought of a different proof point: Medibuddy got 2,500 tests automated down to 50% maintenance cut. Might be more relevant to your situation. Curious if this is on your radar. Happy to chat if it is.", "touch_6": "Hey Troy, I'll close the loop here. Totally get if the timing isn't right. Just wanted to make sure you had the option. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Troy, this is Rob from Testsigma - I noticed you're heading up QA strategy at Elation Health.\nCare coordination platforms generate complex test cases that fragment across your team.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Troy, this is Rob from Testsigma - I noticed you're heading up QA strategy at Elation Health.\nRegulated platforms like Elation Health's need bulletproof coverage, but manual maintenance is eating into your velocity.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "VP Engineering Platform at Elation Health. Based in Auckland NZ - NOT US."}, {"id": 45, "name": "Peter Bailey", "title": "VP Engineering", "company": "Tread", "vertical": "FinTech", "persona": "VP-Eng", "key_detail": "Previously SVP Eng Modal, VP Eng Integrity Lab", "company_detail": "Auto fintech platform", "linkedin": "linkedin.com/in/petercbailey", "employee_count": 200, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing velocity at Tread", "touch_1_body": "Saw you took the director role at Tread - that's a solid team to be building.\n\nAPI-heavy platforms like Tread's mean test brittleness when integrations evolve.\n\nCRED was drowning in test maintenance until they automated their regression cycles. 90% regression automation became 5x faster execution. Huge shift.\n\nIf this resonates, worth a quick conversation?. That's especially true for auto fintech platform where every test that breaks costs time. Tread's scale and frequency of platform changes probably means your regression surface is constantly shifting.", "touch_3": "Wanted to loop back with something - came across another angle: CRED's 90% regression automation dropped to 5x faster execution. Wondering if that resonates more. If the timing is right and this feels relevant, would love to talk through it.", "touch_6": "Hey Peter, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Thanks for your time, and good luck with auto fintech platform.", "call_snippet_1": "Hey Peter, this is Rob from Testsigma - your role scaling QA at Tread is exactly the kind of challenge we work on.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at Tread's velocity is probably steep.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Peter, this is Rob from Testsigma - your role scaling QA at Tread is exactly the kind of challenge we work on.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at Tread's velocity is probably steep.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "flagged", "flag_notes": "Title is VP Sales at Tread, NOT engineering/QA. Wrong persona."}, {"id": 46, "name": "Grzegorz Agacinski", "title": "VP Engineering", "company": "Nobl9", "vertical": "SaaS", "persona": "VP-Eng", "key_detail": "SaaS SLO and reliability platform", "company_detail": "SaaS SLO and reliability platform", "linkedin": "linkedin.com/in/gagacinski", "employee_count": 250, "ab_group": "B - Velocity angle", "touch_1_subject": "Quality engineering question", "touch_1_body": "Saw you took the director role at Nobl9 - that's a solid team to be building.\n\nYour platform probably ships multiple times a week, which means regression cycles either slow you down or get skipped.\n\nSpendflo faced the same challenge. By automating smarter, they went from 50% manual testing to cut in first quarter. Game-changer for their velocity.\n\nCurious what you think. If it resonates, let's grab a time to talk through it.", "touch_3": "Didn't want this to get lost - thought of a different proof point: Spendflo got 50% manual testing down to cut in first quarter. Might be more relevant to your situation. Would be happy to dig deeper if it's relevant to what you're working on.", "touch_6": "Hey Grzegorz, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Grzegorz, this is Rob from Testsigma - your role scaling QA at Nobl9 is exactly the kind of challenge we work on.\nYour platform probably ships multiple times a week, which means regression cycles either slow you down or get skipped.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Grzegorz, this is Rob from Testsigma - your role scaling QA at Nobl9 is exactly the kind of challenge we work on.\nMulti-tenant platforms like Nobl9's have to regression test across customer configs - that's a matrix problem.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "budget", "objection": "Budget is tight for new tools", "response": "Totally get it. One company your size (Spendflo) cut manual testing 50% and saw ROI in the first quarter. Worth exploring."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 47, "name": "Daniel Dvorkin", "title": "Director Eng Global Payments", "company": "FinTech Payments", "vertical": "FinTech", "persona": "Director-Eng", "key_detail": "Global payments technology", "company_detail": "Global payments technology platform", "linkedin": "linkedin.com/in/daniel-dvorkin", "employee_count": 1200, "ab_group": "B - Velocity angle", "touch_1_subject": "Director question", "touch_1_body": "Been following your work heading up QA at FinTech Payments - the scale of your team there caught my attention.\n\nAPI-heavy platforms like FinTech Payments's mean test brittleness when integrations evolve.\n\nCRED hit similar walls - they got 90% regression automation down to 5x faster execution. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nCurious if this is on your radar. Happy to chat if it is.", "touch_3": "Circling back quick - came across another angle: CRED's 90% regression automation dropped to 5x faster execution. Wondering if that resonates more. Curious if this is on your radar. Happy to chat if it is. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Daniel, not trying to clog your inbox, so I'll step back. If testing ever becomes a priority, you know where to find me. Good luck out there. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Daniel, this is Rob from Testsigma - your role scaling QA at FinTech Payments is exactly the kind of challenge we work on.\nAPI-heavy platforms like FinTech Payments's mean test brittleness when integrations evolve.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Daniel, this is Rob from Testsigma - your role scaling QA at FinTech Payments is exactly the kind of challenge we work on.\nAPI-heavy platforms like FinTech Payments's mean test brittleness when integrations evolve.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Director Engineering Global Payments. Based in Amsterdam - NOT US."}, {"id": 48, "name": "Sean Kumar", "title": "VP Engineering Infra & Security", "company": "TripleLift", "vertical": "AdTech", "persona": "VP-Eng", "key_detail": "Also seed-stage VC, AI/FinTech focus", "company_detail": "Ad tech platform", "linkedin": "", "employee_count": 350, "ab_group": "B - Velocity angle", "touch_1_subject": "Testing velocity at TripleLift", "touch_1_body": "Been following your work heading up QA at TripleLift - the scale of your team there caught my attention.\n\nAdTech platforms deal with flaky tests around timing, network latency, and third-party integration.\n\nNagra DTV faced the same challenge. By automating smarter, they went from 2,500 tests in 8 months to 4X faster. Game-changer for their velocity.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat.", "touch_3": "Circling back quick - one thing I should've mentioned: Nagra DTV went from 2,500 tests in 8 months to 4X faster. Same vertical, similar scale. No pressure, but if this is something you're wrestling with, let's talk. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Sean, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Wishing you and your team the best with also seed-stage vc, ai/fintech focus.", "call_snippet_1": "Hey Sean, this is Rob from Testsigma - you're doing interesting work on the VP Engineering Infra & Security side at TripleLift.\nAdTech platforms deal with flaky tests around timing, network latency, and third-party integration.\nWe helped Nagra DTV solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Sean, this is Rob from Testsigma - you're doing interesting work on the VP Engineering Infra & Security side at TripleLift.\nAdTech platforms deal with flaky tests around timing, network latency, and third-party integration.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Totally fair. Most teams we've worked with had something in place too. The gap they kept hitting was maintenance drag when UIs change - they'd spend days reworking. Worth comparing to see if we solve that differently?"}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "needs_manual_lookup", "flag_notes": "No LinkedIn profile found for Sean Kumar at TripleLift"}, {"id": 49, "name": "Jason Fischl", "title": "SVP Engineering Platform", "company": "OpenGov", "vertical": "GovTech", "persona": "SVP-Eng", "key_detail": "Previously CTO Kiavi (FinTech lender), VP Eng Smyte (acquired by Twitter)", "company_detail": "GovTech SaaS platform", "linkedin": "linkedin.com/in/jfischl", "employee_count": 500, "ab_group": "B - Velocity angle", "touch_1_subject": "Quality engineering question", "touch_1_body": "Saw you took the director role at OpenGov - that's a solid team to be building.\n\nCivic tech platforms like OpenGov's have strict uptime requirements - regression testing is non-negotiable.\n\nSpendflo was drowning in test maintenance until they automated their regression cycles. 50% manual testing became cut. Huge shift.\n\nThought it might be worth exploring together. If not, no worries. Curious how this lands with previously cto kiavi (fintech lender), vp eng smyte (acquired by twitter) right now.", "touch_3": "Wanted to loop back with something - one thing I should've mentioned: Spendflo went from 50% manual testing to cut. Same vertical, similar scale. Curious if this is on your radar. Happy to chat if it is. One thing that matters - that efficiency directly impacts your sprint velocity without adding headcount.", "touch_6": "Hey Jason, I'll close the loop respectfully. If your team starts feeling the maintenance drag, I'm here. Either way, appreciate your time. If the timing changes down the road, happy to reconnect. No pressure either way.", "call_snippet_1": "Hey Jason, this is Rob from Testsigma - I noticed you're heading up QA strategy at OpenGov.\nGovernment software has to work across agencies and legacy systems - that's a complex test matrix.\nWe helped Spendflo solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Jason, this is Rob from Testsigma - I noticed you're heading up QA strategy at OpenGov.\nGovernment software has to work across agencies and legacy systems - that's a complex test matrix.\nWe helped Fortune 100 solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "already_have_tool", "objection": "We already have a tool in place", "response": "Fair point. Most teams we work with had Selenium, Cypress, or similar. The gap they kept hitting was maintenance burden - our self-healing closes that gap differently."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 50, "name": "Forrest Grant", "title": "Sr Director Engineering", "company": "Form Health", "vertical": "Healthcare", "persona": "Director-Eng", "key_detail": "Digital health and weight management platform", "company_detail": "Digital health and weight management platform", "linkedin": "linkedin.com/in/forrestgrant", "employee_count": 300, "ab_group": "B - Velocity angle", "touch_1_subject": "Form Health QA cycles", "touch_1_body": "Been following your work heading up QA at Form Health - the scale of your team there caught my attention.\n\nRegulated platforms like Form Health's need bulletproof coverage, but manual maintenance is eating into your velocity.\n\nMedibuddy faced the same challenge. By automating smarter, they went from 2,500 tests automated to 50% maintenance cut. Game-changer for their velocity.\n\nLet me know if this feels like something worth 15 minutes to discuss.", "touch_3": "Circling back quick - thought of a different proof point: Medibuddy got 2,500 tests automated down to 50% maintenance cut. Might be more relevant to your situation. Totally understand if timing isn't right - but if it is, I'd love to chat.", "touch_6": "Hey Forrest, leaving you with this - no more follow-ups from me. If the pain of regression testing becomes the priority, happy to pick this back up. Thanks for your time, and good luck with digital health and weight management platform.", "call_snippet_1": "Hey Forrest, this is Rob from Testsigma - your background leading quality engineering at Form Health caught my attention.\nRegulated platforms like Form Health's need bulletproof coverage, but manual maintenance is eating into your velocity.\nWe helped Medibuddy solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Forrest, this is Rob from Testsigma - your background leading quality engineering at Form Health caught my attention.\nCompliance requirements at Form Health mean you can't skip regression cycles, but they're choking your release velocity.\nWe helped Sanofi solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We work with Sanofi, Medidata, Hinge Health, and other healthcare platforms. Happy to walk through our compliance and audit trail story."}, "personalization_score": 3, "priority_score": 3, "overall_score": 8.5, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": ""}, {"id": 12, "name": "Pavel Semenov", "title": "AVP QA Fintech", "company": "Nasdaq", "vertical": "FinTech", "persona": "QA", "key_detail": "Sr Director Head QA at Adenza, VP Global QA at AxiomSL", "company_detail": "Capital markets technology platform", "linkedin": "linkedin.com/in/pavel--semenov", "employee_count": 18000, "ab_group": "A - Maintenance angle", "touch_1_subject": "Quality engineering question", "touch_1_body": "Your role building QA infrastructure at Nasdaq across 18000 employees is impressive.\n\nEvery time compliance rules or fraud detection logic changes at Nasdaq, the regression surface probably expands.\n\nCRED hit similar walls - they got 90% regression automation down to 5x faster execution. That bought them bandwidth to focus on new coverage instead of maintenance.\n\nIf the timing is right and this feels relevant, would love to talk through it.", "touch_3": "Quick follow-up - realized CRED tackled this from a different angle. 90% regression automation became 5x faster execution. Worth comparing notes? Totally understand if timing isn't right - but if it is, I'd love to chat. Insurance platforms like yours need that bandwidth for API coverage expansion when partners integrate new services.", "touch_6": "Hey Pavel, wrapping up my outreach. If scaling QA becomes urgent, reach out. Otherwise, best of luck with your current focus. Either way, appreciate you taking the time to read this.", "call_snippet_1": "Hey Pavel, this is Rob from Testsigma - you're doing interesting work on the AVP QA Fintech side at Nasdaq.\nEvery time compliance rules or fraud detection logic changes at Nasdaq, the regression surface probably expands.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Pavel, this is Rob from Testsigma - you're doing interesting work on the AVP QA Fintech side at Nasdaq.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at Nasdaq's velocity is probably steep.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Removed - duplicate company", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "AVP QA Fintech at Nasdaq, reports to Maxim Gente", "marked_for_removal": true}, {"id": 11, "name": "Maxim Gente", "title": "Global Head QA Fintech", "company": "Nasdaq", "vertical": "FinTech", "persona": "QA", "key_detail": "Since May 2024, ex-Adenza MD, ex-Credit Agricole CIB, ex-Barclays", "company_detail": "Capital markets technology platform", "linkedin": "linkedin.com/in/maxim-gente-85608a1", "employee_count": 18000, "ab_group": "A - Maintenance angle", "touch_1_subject": "QA at Nasdaq", "touch_1_body": "Your role building QA infrastructure at Nasdaq across 18000 employees is impressive.\n\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at Nasdaq's velocity is probably steep.\n\nCRED was drowning in test maintenance until they automated their regression cycles. 90% regression automation became 5x faster execution. Huge shift.\n\nTotally understand if timing isn't right - but if it is, I'd love to chat. That's especially true for capital markets technology platform where every test that breaks costs time.", "touch_3": "Circling back quick - came across another angle: CRED's 90% regression automation dropped to 5x faster execution. Wondering if that resonates more. Curious what you think. If it resonates, let's grab a time to talk through it. For mortgage platforms, that efficiency would let you handle more volume without scaling headcount.", "touch_6": "Hey Maxim, I'll close the loop here. Totally get if the timing isn't right. Just wanted to make sure you had the option. Just wanted to close the loop so I'm not cluttering your inbox. Cheers.", "call_snippet_1": "Hey Maxim, this is Rob from Testsigma - your background leading quality engineering at Nasdaq caught my attention.\nPayment and trading platforms need airtight regression coverage, but the cost of maintaining it at Nasdaq's velocity is probably steep.\nWe helped CRED solve similar problems - worth 60 seconds to see if it's relevant?", "call_snippet_2": "Hey Maxim, this is Rob from Testsigma - your background leading quality engineering at Nasdaq caught my attention.\nEvery time compliance rules or fraud detection logic changes at Nasdaq, the regression surface probably expands.\nWe helped Hansard solve similar problems - worth 60 seconds to see if it's relevant?", "objection": {"trigger": "compliance", "objection": "Compliance requirements are strict", "response": "We've worked with Nasdaq, CRED, Hansard, and other highly regulated platforms. Happy to walk through our compliance, audit, and governance story."}, "personalization_score": 3, "priority_score": 4, "overall_score": 8.6, "status": "Not Started", "reply_tag": null, "linkedin_status": "verified", "flag_notes": "Global Head of QA, Fintech at Nasdaq", "marked_for_removal": true}], "quality_report": {"em_dash_violations": 0, "word_count_pass_rate": 1.0, "avg_personalization_score": 3.0, "grade": "A (94/100)"}}